const tests = [
  {
    "id": 1,
    "title": "Блок 1",
    "questions": [
      {
        "question": "++++++ В соответствии с Постановлением Президента Республики Узбекистан Ш.Мирзиёева \"О дополнительных мерах по переходу на международные стандарты финансовой отчетности\" от 24 февраля 2020 года, в каком количестве специалистов поставлена задача обеспечить достаточным количеством сотрудников бухгалтерской службы для качественного применения МСФО?",
        "answers": [
          "не менее 2 человек",
          "не менее 5 человек",
          "не менее 4 человек",
          "не менее 3 человек"
        ],
        "correct": 3
      },
      {
        "question": "В каком документе указано, что «требования, касающиеся составления финансовой отчетности по международным стандартам, устанавливаются в международных стандартах финансовой отчетности»?",
        "answers": [
          "В НСБУ",
          "В Трудовом кодексе",
          "В новой редакции статьи 22 Закона Рес. Уз «О бухгалтерском учете»",
          "В Налоговом кодексе"
        ],
        "correct": 2
      },
      {
        "question": "Когда был принят приказ Министра финансов Республики Узбекистан No 61 \"О признании международных стандартов финансовой отчетности и текста пояснений к ним для применения на территории Республики Узбекистан\"?",
        "answers": [
          "24 февраля 2020 г.",
          "4 февраля 2017 г.",
          "24 апреля 2015 г.",
          "10 ноября 2022 г."
        ],
        "correct": 3
      },
      {
        "question": "Сколько МСФО переведено на узбекский язык в соответствии с приказом Министра финансов Республики Узбекистан от 10 ноября 2022 года No 61 \"О признании международных стандартов финансовой отчетности и текста пояснений к ним для применения на территории Республики Узбекистан\"?",
        "answers": [
          "25",
          "5",
          "16",
          "15"
        ],
        "correct": 2
      },
      {
        "question": "В соответствии с приказом Министра финансов Республики Узбекистан от 10 ноября 2022 года No 61 \"О признании международных стандартов финансовой отчетности и текста пояснений к ним для применения на территории Республики Узбекистан\" сколько МСФО переведено на узбекский язык?",
        "answers": [
          "16",
          "5",
          "15",
          "25"
        ],
        "correct": 3
      },
      {
        "question": "В соответствии с приказом Министра финансов Республики Узбекистан от 10 ноября 2022 года No 61 \"О признании международных стандартов финансовой отчетности и текста пояснений к ним для применения на территории Республики Узбекистан,\" комментарии скольких \"Постоянных комитетов по комментариям\" переведены на узбекский язык?",
        "answers": [
          "16",
          "15",
          "25",
          "5"
        ],
        "correct": 3
      },
      {
        "question": "Когда был принят Приказ Министра экономики и финансов No 181 \"Об утверждении Положения о сроках представления финансовой отчетности, а также ее составе и содержании\"?",
        "answers": [
          "24 апреля 2015 г.",
          "10 ноября 2022 г.",
          "8 октября 2024 г.",
          "4 февраля 2017 г."
        ],
        "correct": 2
      },
      {
        "question": "В соответствии с Приказом министра экономики и финансов от 8 октября 2024 года No 181 \"Об утверждении Положения о сроках представления финансовой отчетности, а также ее составе и содержании\" обязательна ли также представление финансовой отчетности по НСБУ организациями, готовящими финансовую отчетность по МСФО?",
        "answers": [
          "принудительный",
          "Это положение ещё не вступило в силу.",
          "нет необязательно",
          "положение не содержит сведений"
        ],
        "correct": 2
      },
      {
        "question": "Найдите отчетный период годовой финансовой отчетности в соответствии с ПОЛОЖЕНИЕМ о сроках представления финансовой отчетности, ее составе и содержании.",
        "answers": [
          "начинается с 1 января и заканчивается 31 декабря",
          "В любое время на предприятии",
          "начинается с 1 января и ежеквартально",
          "начинается с 1 января и заканчивается 1 октября"
        ],
        "correct": 0
      },
      {
        "question": "На какие категории делятся стандарты бухгалтерского учета в международной практике?",
        "answers": [
          "Международные стандарты финансовой отчетности (IFRS), Международные стандарты аудиторский деятельность",
          "Международные стандарты бухгалтерского учета (IAS), Национальные стандарты бухгалтерского учета (НСБУ)",
          "Международные стандарты бухгалтерского учета (IAS) и Международные стандарты финансовой отчетности (IFRS)",
          "Международные стандарты бухгалтерского учета (IAS), стандарты интерпретацию"
        ],
        "correct": 2
      },
      {
        "question": "С 1 января 2025 года ежегодные финансовые отчеты, составленные на основе \"Национальных стандартов бухгалтерского учета,\" должны быть представлены не позднее какого числа следующего года?",
        "answers": [
          "с 1 апреля",
          "с 1 мая",
          "с 15 февраля",
          "С 1 марта"
        ],
        "correct": 3
      },
      {
        "question": "С 1 января 2025 года ежегодные финансовые отчеты, составленные на основе \"Международных стандартов финансовой отчетности,\" должны быть представлены не позднее какого числа следующего года?",
        "answers": [
          "с 15 февраля",
          "с 1 апреля",
          "с 1 марта",
          "С 1 мая"
        ],
        "correct": 3
      },
      {
        "question": "В каком году была разработана новая редакция концептуальной основы представления финансовой отчетности?",
        "answers": [
          "2025 год",
          "2021 год",
          "2018 год",
          "2015 год"
        ],
        "correct": 2
      },
      {
        "question": "Из скольких глав состоит концептуальная основа представления финансовой отчетности?",
        "answers": [
          "5.",
          "4.",
          "6.",
          "8."
        ],
        "correct": 3
      },
      {
        "question": "Какие вопросы рассматриваются в главе 1 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Цель финансовой отчетности для общего пользования",
          "Качественные характеристики полезной финансовой информации",
          "Элементы финансовой отчетности",
          "Финансовая отчетность и подотчетная организация"
        ],
        "correct": 0
      },
      {
        "question": "Какие вопросы рассматриваются в главе 2 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Сформирование элементы финансовой отчетности",
          "Качественные характеристики полезной финансовой информации",
          "Финансовая отчетность и отчеты подотчетный организации",
          "Цель финансовой отчетности общего пользования организации"
        ],
        "correct": 1
      },
      {
        "question": "Какие вопросы рассматриваются в главе 3 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Цель финансовой отчетности общего пользования",
          "Элементы финансовой отчетности",
          "Качественные характеристики полезной финансовой информации",
          "Финансовая отчетность и подотчетная организация"
        ],
        "correct": 3
      },
      {
        "question": "Какие вопросы рассматриваются в главе 3 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Цель финансовой отчетности общего пользования",
          "Элементы финансовой отчетности",
          "Финансовая отчетность и подотчетная организация",
          "Качественные характеристики полезной финансовой информации"
        ],
        "correct": 2
      },
      {
        "question": "Какие вопросы рассматриваются в главе 5 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Финансовая отчетность и подотчетная организация",
          "Качественные характеристики полезной финансовой информации",
          "Цель финансовой отчетности общего пользования",
          "Признание и отмена признания"
        ],
        "correct": 3
      },
      {
        "question": "Какие вопросы рассматриваются в главе 6 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Оценка",
          "Цель финансовой отчетности общего пользования",
          "Признание и отмена признания",
          "Финансовая отчетность и подотчетная организация"
        ],
        "correct": 0
      },
      {
        "question": "Какие вопросы рассматриваются в главе 7 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "предоставление и освещение информации",
          "Признание и отмена признания",
          "Оценка",
          "Цель финансовой отчетности общего пользования"
        ],
        "correct": 0
      },
      {
        "question": "Какие вопросы рассматриваются в главе 8 концептуальной основы представления финансовой отчетности?",
        "answers": [
          "Концепции капитала и поддержания капитала",
          "Оценка",
          "Признание и отмена признания",
          "Предоставление и освещение информации"
        ],
        "correct": 0
      },
      {
        "question": "В соответствии с концептуальной основой представления финансовой отчетности, на какие виды подразделяются концепции поддержания капитала?",
        "answers": [
          "концепция поддержания физического капитала",
          "отсутствует концепция поддержания капитала.",
          "Концепция поддержания финансового капитала",
          "концепция поддержания финансового и физического капитала"
        ],
        "correct": 3
      },
      {
        "question": "Какой из следующих отчетов отражает финансовое положение организации?",
        "answers": [
          "Отчет о движении денежных средств",
          "Отчет об изменениях в собственном капитале",
          "Отчет о финансовом положении",
          "Отчет о прибылях и убытках и других совокупных доходах"
        ],
        "correct": 2
      },
      {
        "question": "Какой из следующих отчетов отражает финансовый результат организации?",
        "answers": [
          "Отчет о движении денежных средств",
          "Отчет о прибылях и убытках и других совокупных доходах",
          "Отчет о финансовом положении",
          "Отчет Финансовая положение организации"
        ],
        "correct": 1
      }
    ]
  },
  {
    "id": 2,
    "title": "Блок 2",
    "questions": [
      {
        "question": "Какой из следующих отчетов отражает денежные потоки организации?",
        "answers": [
          "Отчет о прибылях и убытках и других совокупных доходах",
          "Отчет об изменениях в собственном капитале",
          "Отчет о движении денежных средств",
          "Отчет о финансовом положении"
        ],
        "correct": 2
      },
      {
        "question": "Как называются активы, полученные арендатором по договору финансовой аренды, в финансовой отчетности?",
        "answers": [
          "основное средство",
          "финансовый инструмент",
          "финансовый актив",
          "актив в доступе"
        ],
        "correct": 3
      },
      {
        "question": "Как называется увеличение активов или уменьшение обязательств, не связанное с инвестициями собственников в капитал, но приводящее к росту собственного капитала?",
        "answers": [
          "расход",
          "убыток",
          "доход",
          "прибыль"
        ],
        "correct": 2
      },
      {
        "question": "Как называется уменьшение активов или увеличение обязательств, приводящее к уменьшению собственного капитала, не связанного с распределением прав требования к собственному капиталу?",
        "answers": [
          "убыток",
          "доход",
          "расход",
          "прибыль"
        ],
        "correct": 2
      },
      {
        "question": "Какой доход организация получает от своей обычной деятельности?",
        "answers": [
          "выручка",
          "доход",
          "прибыль",
          "чистая выручка"
        ],
        "correct": 0
      },
      {
        "question": "Какой вид деятельности включает в себя необходимые, обычные и дополнительные практики и коммерческие операции?",
        "answers": [
          "Инвестиционная деятельность",
          "Обычнаяактивность",
          "Общая деятельность",
          "Финансовая деятельность"
        ],
        "correct": 1
      },
      {
        "question": "В соответствии с каким международно-правовым документом регулируются принципы определения выручки по договорам с покупателями?",
        "answers": [
          "МСФО No15",
          "МСФО No 16",
          "МСФО No 23",
          "МСФО No 1"
        ],
        "correct": 0
      },
      {
        "question": "Сколько существует этапов признания выручки в соответствии с МСФО No 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "5 этапов",
          "4 этапов",
          "3 этапов",
          "6 этапов"
        ],
        "correct": 0
      },
      {
        "question": "Что определяется на 1-м этапе по пятиэтапной модели признания выручки в соответствии с МСФО No 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "Определение ответственности за исполнение",
          "Распределение цены договора на ответственность за исполнение",
          "Определение контракта",
          "Определение контрактной цены"
        ],
        "correct": 2
      },
      {
        "question": "Что определяется на 2-м этапе по пятиступенчатой модели признания выручки в соответствии с МСФО No 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "Определение договора",
          "Определение контрактной цены",
          "Определение ответственности за выполнение",
          "Распределение цены договора на ответственность за исполнение"
        ],
        "correct": 2
      },
      {
        "question": "Что определяется на 3-м этапе по пятиэтапной модели признания выручки в соответствии с МСФО No 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "Определение договора",
          "Определение ответственности за исполнение",
          "Распределение цены договора на ответственность за исполнение",
          "Определение цены контракта"
        ],
        "correct": 3
      },
      {
        "question": "Что определяется на 4-м этапе по пятиэтапной модели признания выручки в соответствии с МСФО 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "Определение договора, цену, сроки и график платежей",
          "Распределение цены контракта по ответственности за выполнение",
          "Определение ответственности за исполнение, и обязательства",
          "Определение контрактной цены, и сроки поставки"
        ],
        "correct": 1
      },
      {
        "question": "Что определяется на 5-м этапе по пятиэтапной модели признания выручки в соответствии с МСФО No 15 \"Выручка по договорам с покупателями\"?",
        "answers": [
          "Признание выручки при удовлетворении ответственности за выполнение",
          "Определение ответственности за исполнение",
          "Определение договора и цену по исполнение",
          "Определение контрактной цены"
        ],
        "correct": 0
      },
      {
        "question": "Как называется право организации на возмещение, получаемое в обмен на товары или услуги, поставленные покупателю, по причинам, отличным от истечения определенного срока?",
        "answers": [
          "актив с правом пользования",
          "договорный актив",
          "выручка",
          "дебиторская задолженность"
        ],
        "correct": 1
      },
      {
        "question": "Каковы международные стандарты основной финансовой отчетности, регулирующие финансовые инструменты?",
        "answers": [
          "МСФО (IAS) 32, МСФО (IFRS) 7, МСФО (IFRS) 5.",
          "МСФО (IAS) 32, МСФО (IFRS) 12, МСФО (IFRS) 9.",
          "МСФО (IAS) 36, МСФО (IFRS) 7, МСФО (IFRS) 9.",
          "МСФО (IAS) 32, МСФО (IFRS) 7, МСФО (IFRS) 9."
        ],
        "correct": 3
      },
      {
        "question": "Финансовый инструмент - это...",
        "answers": [
          "наличные денежные средства, право на получение и обмен денежных средств или финансовых активов от других хозяйствующих субъектов в соответствии с договором, а также долевые средства другого хозяйствующего субъекта.",
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "это тип договора, который приводит к возникновению финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации.",
          "любой договор, подтверждающий долю активов, оставшихся после вычета обязательств хозяйствующего субъекта перед другим хозяйствующим субъектом."
        ],
        "correct": 2
      },
      {
        "question": "Финансовое обязательство - это...",
        "answers": [
          "любой договор, подтверждающий долю активов, оставшихся после вычета обязательств хозяйствующего субъекта перед другим хозяйствующим субъектом.",
          "вид договора, приводящий к возникновению финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации.",
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "наличные денежные средства, право на получение и обмен денежных средств или финансовых активов от других хозяйствующих субъектов в соответствии с договором, а также долевые средства другого хозяйствующего субъекта."
        ],
        "correct": 2
      },
      {
        "question": "Финансовый актив - это...",
        "answers": [
          "любой договор, подтверждающий долю активов, оставшихся после вычета обязательств хозяйствующего субъекта перед другим хозяйствующим субъектом.",
          "вид договора, приводящий к возникновению финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации.",
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "наличные денежные средства, право на получение и обмен денежных средств или финансовых активов от других хозяйствующих субъектов в соответствии с договором, а также долевые средства другого хозяйствующего субъекта."
        ],
        "correct": 3
      },
      {
        "question": "Долевой инструмент - это......",
        "answers": [
          "наличные денежные средства, право на получение и обмен денежных средств или финансовых активов от других хозяйствующих субъектов в соответствии с договором, а также долевые средства другого хозяйствующего субъекта.",
          "любой договор, подтверждающий долю активов, оставшихся после вычета обязательств хозяйствующего субъекта перед другим хозяйствующим субъектом.",
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "вид договора, приводящий к возникновению финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации."
        ],
        "correct": 1
      },
      {
        "question": "В каком варианте правильно указаны первоначальное признание финансового актива и методы его последующей оценки?",
        "answers": [
          "По справедливой стоимости через прочий совокупный доход; По справедливой стоимости через прибыль или убыток.",
          "по амортизированной стоимости; По справедливой стоимости через прочий совокупный доход; По справедливой стоимости через прибыль или убыток.",
          "по амортизированной стоимости; по справедливой стоимости через прочий совокупный доход;",
          "По амортизированной стоимости; По справедливой стоимости через прибыль или убыток."
        ],
        "correct": 1
      },
      {
        "question": "Какой стандарт используется при раскрытии информации, связанной с финансовыми инструментами, в примечаниях?",
        "answers": [
          "МСФО (IFRS) 9",
          "МСФО (IFRS) 7",
          "МСФО (IAS) 36",
          "МСФО (IAS) 32"
        ],
        "correct": 1
      },
      {
        "question": "Расходы по займам - это.........?",
        "answers": [
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "вид договора, приводящий к возникновению финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации.",
          "наличные денежные средства, право на получение и обмен денежных средств или финансовых активов от других хозяйствующих субъектов в соответствии с договором, а также долевые средства другого хозяйствующего субъекта.",
          "Проценты и другие расходы, понесенные организацией в связи с получением заемных средств."
        ],
        "correct": 3
      },
      {
        "question": "Какой стандарт используется при организации учета расходов по займам в соответствии с Международным стандартом финансовой отчетности?",
        "answers": [
          "МСФО (IAS) 10",
          "МСФО (IFRS) 1",
          "МСФО (IAS) 23",
          "МСФО (IAS) 36"
        ],
        "correct": 2
      },
      {
        "question": "Квалифицированные активы - это...?",
        "answers": [
          "любое обязательство, означающее передачу или обмен денежных средств и других финансовых активов другим хозяйствующим субъектам посредством договорного обязательства.",
          "Активы, требующие длительного времени и предназначенные для хозяйственных нужд или продажи на основе определенных условий и задач.",
          "вид договора, влекущий возникновение финансового актива в одной организации и финансового обязательства или долевого инструмента в другой организации.",
          "проценты и другие расходы, понесенные организацией в связи с получением заемных средств."
        ],
        "correct": 1
      },
      {
        "question": "Учетная политика — это:",
        "answers": [
          "Законодательные документы и методические рекомендации по ведению бухгалтерского учета на предприятии.",
          "указания местных органов по регулированию бухгалтерского учета и рабочий план счетов предприятия.",
          "Общая практика подготовки и представления финансовой отчетности предприятия.",
          "Совокупность конкретных принципов, основ, соглашений, правил и практик, принятых предприятием для подготовки и представления финансовой отчетности."
        ],
        "correct": 3
      }
    ]
  },
  {
    "id": 3,
    "title": "Блок 3",
    "questions": [
      {
        "question": "Определите элементы финансовой отчетности.",
        "answers": [
          "Активы, обязательства, доходы, расходы",
          "Активы, пассивы, прибыль и убытки",
          "Активы, пассивы, расходы и доходы",
          "Активы, обязательства, капитал, доходы, расходы (прибыль и убытки)"
        ],
        "correct": 3
      },
      {
        "question": "Определите объекты бухгалтерского учета.",
        "answers": [
          "Классификация различных затрат, связанных с воспроизводством рабочей силы и подготовкой кадров.",
          "Материальные и денежные средства, принадлежащие предприятию, а также его юридические отношения с другими организациями и учреждениями.",
          "Формирование информации, необходимой для эффективного управления ресурсами предприятий, организаций и учреждений.",
          "Долгосрочные и текущие активы, обязательства, собственный капитал, резервы, доходы и расходы, прибыль, убытки и хозяйственные операции, связанные с их движением."
        ],
        "correct": 3
      },
      {
        "question": "Каково основное бухгалтерское уравнение?",
        "answers": [
          "Актив = Обязательства + Собственный капитал",
          "Деньги и ценные бумаги",
          "Основные активы и текущие активы",
          "Доходы и расходы"
        ],
        "correct": 0
      },
      {
        "question": "Как называется 12-й МСФО?",
        "answers": [
          "Налог на прибыль",
          "Затраты по займам",
          "Учетная политика",
          "Аренда"
        ],
        "correct": 0
      },
      {
        "question": "Кем определяется учетная политика?",
        "answers": [
          "Внутренним аудитом",
          "Хозяйствующим субъектом",
          "Министерством экономики и финансов",
          "Вышестоящим органом"
        ],
        "correct": 1
      },
      {
        "question": "Как называется 36-й МСФО?",
        "answers": [
          "Обесценение активов",
          "Отчет о движении денежных средств",
          "Бухгалтерский учет финансово-хозяйственной деятельности хозяйствующих субъектов",
          "План счетов и инструкция по его применению"
        ],
        "correct": 0
      },
      {
        "question": "С каким видом деятельности связан 23-й МСФО?",
        "answers": [
          "Финансовая деятельность",
          "Инвестиционная деятельность",
          "Деятельность по определению результатов",
          "Деятельность по представлению финансовой отчетности"
        ],
        "correct": 0
      },
      {
        "question": "Какой принцип требует, чтобы в финансовой отчетности не допускалось завышение стоимости активов и доходов, а также занижение обязательств или расходов?",
        "answers": [
          "Реальная стоимость активов и обязательств",
          "Существенность",
          "Сопоставимость показателей",
          "Осторожность (осмотрительность)"
        ],
        "correct": 3
      },
      {
        "question": "К какой деятельности относится выплата денежных средств за приобретение основных средств, нематериальных и других долгосрочных активов?",
        "answers": [
          "Финансовая деятельность",
          "Операционная деятельность",
          "Основная деятельность",
          "Инвестиционная деятельность"
        ],
        "correct": 3
      },
      {
        "question": "Сколько видов деятельности отражено в отчете о движении денежных средств?",
        "answers": [
          "4",
          "3",
          "8",
          "5"
        ],
        "correct": 1
      },
      {
        "question": "Какой вид деятельности определяется как «основная доход образующая деятельность субъекта, а также иная хозяйственная деятельность, не относящаяся к инвестиционной и финансовой»?",
        "answers": [
          "Основная деятельность",
          "Финансовая деятельность",
          "Инвестиционная деятельность",
          "Операционная деятельность"
        ],
        "correct": 3
      },
      {
        "question": "Какой вид деятельности определяется как «приобретение и продажа долгосрочных активов и других инвестиционных объектов, не включенных в эквиваленты денежных средств»?",
        "answers": [
          "Операционная деятельность",
          "Финансовая деятельность",
          "Инвестиционная деятельность",
          "Основная деятельность"
        ],
        "correct": 2
      },
      {
        "question": "Какой вид деятельности — это «деятельность, в результате которой происходят изменения в размере и структуре собственного и заемного капитала»?",
        "answers": [
          "Основная деятельность",
          "Операционная деятельность",
          "Финансовая деятельность",
          "Инвестиционная деятельность"
        ],
        "correct": 2
      },
      {
        "question": "Покупка основных средств в обмен на акции компании отражается в каком разделе отчета о движении денежных средств?",
        "answers": [
          "Неденежные операции",
          "Операционная деятельность",
          "Финансовая деятельность",
          "Инвестиционная деятельность"
        ],
        "correct": 0
      },
      {
        "question": "В каких случаях проводится оценка запасов по чистой стоимости реализации?",
        "answers": [
          "Когда запасы полностью или частично устаревают",
          "Когда цена продажи снижается, запасы полностью или частично устаревают, либо повреждены",
          "Когда уменьшаются прочие операционные расходы",
          "Когда увеличиваются управленческие расходы, а прочие операционные уменьшаются"
        ],
        "correct": 1
      },
      {
        "question": "Кто начисляет амортизацию при финансовой аренде основных средств?",
        "answers": [
          "Обе стороны",
          "Арендодатель",
          "Арендатор",
          "Никто"
        ],
        "correct": 2
      },
      {
        "question": "По какой стоимости учитываются основные средства?",
        "answers": [
          "По амортизируемой стоимости",
          "По ликвидационной стоимости",
          "По первоначальной стоимости",
          "По произвольной стоимости"
        ],
        "correct": 2
      },
      {
        "question": "Балансовая стоимость основного средства — это:",
        "answers": [
          "Сумма, которую предприятие может получить при выбытии актива за вычетом расходов на продажу",
          "Себестоимость за вычетом ликвидационной стоимости",
          "Денежная сумма, уплаченная при покупке актива",
          "актив признается после вычета накопленной амортизации и убытков от обесценения."
        ],
        "correct": 3
      },
      {
        "question": "Материальные активы, удерживаемые организацией для использования в производстве продукции, выполнении работ, оказании услуг либо для административных и социальных целей:",
        "answers": [
          "Основные средства",
          "Материалы",
          "Запасы",
          "Нематериальные активы"
        ],
        "correct": 0
      },
      {
        "question": "Согласно МСФО (IAS) 2 «Запасы», как оцениваются запасы?",
        "answers": [
          "По наибольшей из двух величин — себестоимости и чистой стоимости реализации",
          "По наименьшей из двух величин — себестоимости и чистой стоимости реализации",
          "По средней величине между себестоимостью и чистой стоимостью реализации",
          "По любой из указанных величин"
        ],
        "correct": 1
      },
      {
        "question": "Что такое выручка?",
        "answers": [
          "Включает в себя прибыль.",
          "Это доход, включающий налог на добавленную стоимость.",
          "Сумма торговых и оптовых скидок.",
          "Это общий приток экономических выгод в ходе обычной деятельности компании, приводящий к увеличению капитала не за счет вкладов акционеров."
        ],
        "correct": 3
      },
      {
        "question": "Какой МСФО регулирует учет нематериальных активов?",
        "answers": [
          "МСФО (IAS) 16 «Основные средства»",
          "МСФО (IAS) 2 «Запасы»",
          "МСФО (IAS) 38 «Нематериальные активы»",
          "МСФО (IAS) 36 «Обесценение активов»"
        ],
        "correct": 2
      },
      {
        "question": "К нематериальным активам относятся:",
        "answers": [
          "Запасы и готовая продукция",
          "Денежные средства и их эквиваленты",
          "Патенты, лицензии, программное обеспечение,",
          "Основные средства и оборудование"
        ],
        "correct": 2
      },
      {
        "question": "Какие активы не имеют физической формы, но приносят будущие экономические выгоды?",
        "answers": [
          "Запасы",
          "Нематериальные активы",
          "Финансовые инструменты",
          "Основные средства"
        ],
        "correct": 1
      },
      {
        "question": "Что такое амортизируемая стоимость?",
        "answers": [
          "Текущая рыночная стоимость актива",
          "Первоначальная стоимость актива за вычетом его ликвидационной стоимости",
          "Сумма начисленной амортизации",
          "Стоимость, по которой актив отражается в бухгалтерском балансе"
        ],
        "correct": 1
      }
    ]
  },
  {
    "id": 4,
    "title": "Блок 4",
    "questions": [
      {
        "question": "Каким методом начисляется амортизация в равных долях в течение срока полезного использования?",
        "answers": [
          "Производственный метод",
          "Пропорциональный метод",
          "Метод уменьшаемого остатка",
          "Линейный метод"
        ],
        "correct": 3
      },
      {
        "question": "Что означает термин «ликвидационная стоимость»?",
        "answers": [
          "Первоначальная стоимость актива",
          "Остаточная стоимость",
          "Амортизируемая стоимость",
          "организация ожидает получить от выбытия актива"
        ],
        "correct": 3
      },
      {
        "question": "Какой МСФО регулирует учет основных средств?",
        "answers": [
          "МСФО (IAS) 36 «Обесценение активов»",
          "МСФО (IAS) 38 «Нематериальные активы»",
          "МСФО (IAS) 40 «Инвестиционная недвижимость»",
          "МСФО (IAS) 16 «Основные средства»"
        ],
        "correct": 3
      },
      {
        "question": "Что означает термин «капитализация затрат»?",
        "answers": [
          "Включение затрат в первоначальную стоимость актива",
          "Переоценка активов",
          "Списание затрат на расходы периода",
          "Отражение затрат на счете доходов"
        ],
        "correct": 0
      },
      {
        "question": "Какая стоимость учитывается в бухгалтерском балансе после вычета амортизации и убытков от обесценения?",
        "answers": [
          "Ликвидационная стоимость",
          "Балансовая стоимость",
          "Амортизируемая стоимость",
          "Первоначальная стоимость"
        ],
        "correct": 1
      },
      {
        "question": "Что представляет собой переоценка активов?",
        "answers": [
          "Обесценение актива, Увеличение или уменьшение балансовой стоимости актива",
          "Увеличение или уменьшение балансовой стоимости актива в соответствии с его справедливой (рыночной) стоимостью.",
          "Списание затрат на ремонт который увеличит балансовый стоимость",
          "Начисление амортизации, от балансовой стоимости актива в соответствии с его справедливой стоимостью."
        ],
        "correct": 1
      },
      {
        "question": "Какой метод амортизации основывается на объеме произведенной продукции?",
        "answers": [
          "Производственный метод",
          "Метод уменьшаемого остатка",
          "Линейный метод",
          "Пропорциональный метод"
        ],
        "correct": 0
      },
      {
        "question": "Что такое обесценение актива?",
        "answers": [
          "Уменьшение балансовой стоимости актива ниже его возмещаемой суммы.",
          "Увеличение начисленный амортизации активов",
          "Списание актива после окончания срока использования",
          "Переоценка актива до справедливой стоимости"
        ],
        "correct": 0
      },
      {
        "question": "Что означает термин «справедливая стоимость»?",
        "answers": [
          "Первоначальная стоимость",
          "Ликвидационная стоимость",
          "Цена, которая была бы получена при продаже актива или уплачена при передаче обязательства между участниками рынка на дату оценки.",
          "Балансовая стоимость актива"
        ],
        "correct": 2
      },
      {
        "question": "Какой МСФО регулирует признание выручки?",
        "answers": [
          "МСФО (IAS) 37 «Резервы, условные обязательства и активы»",
          "МСФО (IAS) 1 «Представление финансовой отчетности»",
          "МСФО (IFRS) 15 «Выручка по договорам с покупателями»",
          "МСФО (IAS) 18 «Выручка»"
        ],
        "correct": 2
      },
      {
        "question": "Когда признается выручка по МСФО (IFRS) 15?",
        "answers": [
          "Когда выставлен счет-фактура, и доверенность",
          "После завершения отчетного периода и к отгруженный товарам не имеется претензия",
          "Когда контроль над товарами или услугами переходит покупателю.",
          "Когда получена оплата, и полностью условия договор исполнен"
        ],
        "correct": 2
      },
      {
        "question": "Кто признает актив на балансе при финансовой аренде?",
        "answers": [
          "Арендодатель",
          "Арендатор",
          "Обе стороны",
          "Никто"
        ],
        "correct": 1
      },
      {
        "question": "Что представляет собой «отложенный налог» согласно МСФО (IAS) 12?",
        "answers": [
          "Налог на прибыль за текущий отчетный период",
          "Налог на имущество, с учетом постоянного разнице",
          "Налог с продаж за полный отчетный период",
          "Налог на прибыль, подлежащий уплате или возмещению в будущих периодах."
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 1?",
        "answers": [
          "Отчет о финансовом положение, Налог на прибыль",
          "Учет основных средств и выбытья в отчетном периоде",
          "Представление финансовой отчетности",
          "Учет запасов и отражение в отчетах"
        ],
        "correct": 2
      },
      {
        "question": "Какой отчет показывает поступление и выбытие денежных средств за период?",
        "answers": [
          "Отчет финансовый положение, Баланс",
          "Отчет о движении денежных средств",
          "Отчет об изменениях капитала",
          "Отчет о прибылях и убытках"
        ],
        "correct": 1
      },
      {
        "question": "Какой отчет показывает финансовое положение предприятия на определенную дату?",
        "answers": [
          "Отчет об изменениях капитала",
          "Бухгалтерский баланс",
          "Отчет о движении денежных средств",
          "Отчет о прибылях и убытках"
        ],
        "correct": 1
      },
      {
        "question": "Какой отчет отражает финансовые результаты деятельности предприятия за период?",
        "answers": [
          "Отчет об изменениях капитала",
          "Отчет о движении денежных средств",
          "Бухгалтерский баланс",
          "Отчет о прибылях и убытках"
        ],
        "correct": 3
      },
      {
        "question": "Что отражает отчет об изменениях капитала?",
        "answers": [
          "Изменение запасов и обязательств за отчетный период",
          "Движение денежных средств предприятия за отчетный период",
          "Изменения в составе собственного капитала за отчетный период",
          "Прибыль и убытки предприятия за отчетный период"
        ],
        "correct": 2
      },
      {
        "question": "Какой документ отражает денежные потоки предприятия?",
        "answers": [
          "Отчет о движении денежных средств",
          "Отчет о прибылях и убытках",
          "Отчет об изменениях капитала",
          "Бухгалтерский баланс"
        ],
        "correct": 0
      },
      {
        "question": "Какие виды деятельности выделяются в отчете о движении денежных средств?",
        "answers": [
          "Операционная, инвестиционная и финансовая",
          "Инвестиционная и хозяйственная",
          "Доходная и расходная",
          "Основная, производственная и инвестиционная"
        ],
        "correct": 0
      },
      {
        "question": "Какой метод используется для составления отчета о движении денежных средств?",
        "answers": [
          "Инвестиционный метод",
          "Прямой или косвенный метод",
          "Финансовый метод",
          "Линейный метод"
        ],
        "correct": 1
      },
      {
        "question": "Какая категория отражает долги покупателей перед предприятием?",
        "answers": [
          "Финансовые обязательства",
          "Доходы будущих периодов",
          "Кредиторская задолженность",
          "Дебиторская задолженность"
        ],
        "correct": 3
      },
      {
        "question": "Что означает термин «кредиторская задолженность»?",
        "answers": [
          "Задолженность покупателей перед предприятием",
          "Амортизация активов",
          "Долгосрочные инвестиции",
          "Обязательства предприятия перед поставщиками и другими кредиторами"
        ],
        "correct": 3
      },
      {
        "question": "Что представляет собой «оборотный капитал»?",
        "answers": [
          "Прибыль предприятия",
          "Совокупность всех активов предприятия",
          "Разница между текущими активами и текущими обязательствами",
          "Денежные средства и запасы"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 37?",
        "answers": [
          "Выручка",
          "Запасы",
          "Основные средства",
          "Резервы, условные обязательства и условные активы"
        ],
        "correct": 3
      }
    ]
  },
  {
    "id": 5,
    "title": "Блок 5",
    "questions": [
      {
        "question": "Что такое «резерв» согласно МСФО (IAS) 37?",
        "answers": [
          "Отложенный налоговый актив",
          "финансовый актив предприятия",
          "Обязательство с неопределенной суммой или сроком исполнения",
          "Нераспределенная прибыль"
        ],
        "correct": 2
      },
      {
        "question": "Что означает термин «условное обязательство»?",
        "answers": [
          "Обязательство с фиксированным сроком оплаты",
          "Потенциальное обязательство, возникновение которого зависит от будущих событий",
          "Убытки прошлых лет",
          "Срочное обязательство"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 10?",
        "answers": [
          "Инвестиционная недвижимость",
          "События после отчетной даты",
          "Сводную отчетность",
          "Отложенные налоги"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 7?",
        "answers": [
          "Основные средства",
          "Отчет о движении денежных средств",
          "Резервы",
          "Выручка"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 8?",
        "answers": [
          "Инвестиционная недвижимость и отражения в отчетах",
          "Финансовая аренда и отражения в отчетах",
          "Нематериальные активы и амортизация в отчетном периоде",
          "Учетная политика, изменения в бухгалтерских оценках и ошибки"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 16?",
        "answers": [
          "Резервы",
          "Основные средства",
          "Запасы",
          "Выручка"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 2?",
        "answers": [
          "Нематериальные активы",
          "Основные средства",
          "Запасы",
          "Амортизация"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 24?",
        "answers": [
          "Инвестиции",
          "Раскрытие информации о связанных сторонах",
          "Резервы",
          "Финансовые инструменты"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 40?",
        "answers": [
          "Амортизация",
          "Финансовые инструменты",
          "Запасы",
          "Инвестиционная недвижимость"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 16?",
        "answers": [
          "Резервы",
          "Запасы",
          "Аренда",
          "Выручка"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 9?",
        "answers": [
          "Инвестиции",
          "Аренда",
          "Финансовые инструменты",
          "Основные средства"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 13?",
        "answers": [
          "Оценка по справедливой стоимости",
          "Запасы",
          "Инвестиционная недвижимость",
          "Нематериальные активы"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 5?",
        "answers": [
          "Основные средства",
          "активы, предназначенные для продажи, и прекращенная деятельность",
          "Запасы",
          "Финансовые обязательства"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 3?",
        "answers": [
          "Инвестиции",
          "Выручка",
          "Основные средства",
          "Объединение бизнеса"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 8?",
        "answers": [
          "Резервы",
          "Выручка",
          "Отложенные налоги",
          "Сегментная отчетность"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 11?",
        "answers": [
          "Инвестиции",
          "Основные средства",
          "Совместная деятельность",
          "Запасы"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 10?",
        "answers": [
          "Финансовая аренда",
          "Консолидированная финансовая отчетность",
          "Резервы",
          "Инвестиции"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 2?",
        "answers": [
          "Финансовые инструменты",
          "Выручка",
          "Платежи на основе акций",
          "Основные средства"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 4?",
        "answers": [
          "Нематериальные активы",
          "Инвестиции",
          "Резервы",
          "Договоры страхования"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 14?",
        "answers": [
          "Аренда",
          "Инвестиции",
          "Отложенные счета по тарифному регулированию",
          "Налог на прибыль"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 17?",
        "answers": [
          "Финансовые инструменты",
          "Страховые контракты",
          "Выручка",
          "Основные средства"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 12?",
        "answers": [
          "Раскрытие информации о долях участия в других организациях",
          "Инвестиции",
          "Основные средства",
          "Отчет о движении денежных средств"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 1?",
        "answers": [
          "Консолидированная отчетность",
          "Первое применение Международных стандартов финансовой отчетности",
          "Основные средства",
          "Нематериальные активы"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 6?",
        "answers": [
          "Финансовые инструменты",
          "Резервы",
          "Разведка и оценка минеральных ресурсов",
          "Выручка"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 7?",
        "answers": [
          "Запасы",
          "Инвестиции",
          "Раскрытие информации о финансовых инструментах",
          "Нематериальные активы"
        ],
        "correct": 2
      }
    ]
  },
  {
    "id": 6,
    "title": "Блок 6",
    "questions": [
      {
        "question": "Что регулирует МСФО (IFRS) 19?",
        "answers": [
          "Запасы",
          "Инвестиции",
          "Вознаграждения работникам",
          "Финансовые инструменты"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 20?",
        "answers": [
          "Запасы",
          "Государственные субсидии и раскрытие государственной помощи",
          "Финансовая аренда",
          "Резервы"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 24?",
        "answers": [
          "Амортизация",
          "Финансовые инструменты",
          "Раскрытие информации о связанных сторонах",
          "Резервы"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 26?",
        "answers": [
          "Учет и отчетность пенсионных планов",
          "Аренда",
          "Финансовые инструменты",
          "Основные средства"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 27?",
        "answers": [
          "Выручка",
          "Консолидированная отчетность",
          "Объединение бизнеса",
          "Отдельная финансовая отчетность"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 28?",
        "answers": [
          "Инвестиции в ассоциированные и совместные предприятия",
          "Финансовые инструменты",
          "Аренда",
          "Резервы"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 29?",
        "answers": [
          "Запасы",
          "Основные средства",
          "Финансовые обязательства",
          "Финансовая отчетность в условиях гиперинфляции"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 30?",
        "answers": [
          "Раскрытие информации в финансовой отчетности банков и аналогичных финансовых институтов",
          "Основные средства",
          "Выручка",
          "Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 31?",
        "answers": [
          "Запасы на складе и производстве",
          "Инвестиции в финансовой деятельности",
          "Основные средства в производстве",
          "Учет долей в совместной деятельности"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 32?",
        "answers": [
          "Представление финансовых инструментов",
          "Оценка активов",
          "Учет Запасов",
          "Арендный операция"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 33?",
        "answers": [
          "Финансовая аренда",
          "Прибыль на акцию",
          "Инвестиции",
          "Резервы"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 34?",
        "answers": [
          "Консолидированная отчетность",
          "Промежуточная финансовая отчетность",
          "Основные средства",
          "Выручка"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 35?",
        "answers": [
          "Инвестиции",
          "Резервы",
          "Прекращенная деятельность",
          "Финансовые инструменты"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IFRS) 36?",
        "answers": [
          "Нематериальные активы",
          "Финансовые инструменты",
          "Запасы",
          "Обесценение активов"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 37?",
        "answers": [
          "Основные средства",
          "Резервы, условные обязательства и условные активы",
          "Финансовые инструменты",
          "Запасы"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IFRS) 38?",
        "answers": [
          "Нематериальные активы",
          "Инвестиции",
          "Запасы",
          "Финансовые инструменты"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 39?",
        "answers": [
          "Резервы",
          "Финансовая аренда",
          "Основные средства",
          "Признание и оценка финансовых инструментов"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IFRS) 40?",
        "answers": [
          "Инвестиционная недвижимость",
          "Запасы",
          "Нематериальные активы",
          "Финансовые инструменты"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IFRS) 41?",
        "answers": [
          "Сельское хозяйство",
          "Резервы",
          "Финансовые инструменты",
          "Запасы"
        ],
        "correct": 0
      },
      {
        "question": "Какова основная цель МСФО?",
        "answers": [
          "Снижение расходов организаций",
          "Повышение внутреннего контроля",
          "Создание единой системы международных стандартов для сопоставимой и прозрачной финансовой отчетности",
          "Упрощение налогового учета"
        ],
        "correct": 2
      },
      {
        "question": "Что представляет собой Концептуальная основа МСФО?",
        "answers": [
          "Инструкция по бухгалтерскому учету для организации всех стран",
          "Документ, определяющий принципы, цели и элементы подготовки финансовой отчетности",
          "Методические указания Министерство Экономики и финансов",
          "План счетов бухгалтерского учета для определенный организации"
        ],
        "correct": 1
      },
      {
        "question": "Какой орган утверждает МСФО?",
        "answers": [
          "Всемирный банк",
          "Совет по международным стандартам финансовой отчетности (IASB)",
          "Международный валютный фонд (МВФ)",
          "Организация Объединенных Наций (ООН)"
        ],
        "correct": 1
      },
      {
        "question": "Где находится штаб-квартира Совета по МСФО (IASB)?",
        "answers": [
          "Париж, Франция",
          "Лондон, Великобритания",
          "Женева, Швейцария",
          "Вашингтон, США"
        ],
        "correct": 1
      },
      {
        "question": "Какой документ определяет структуру и деятельность Фонда МСФО?",
        "answers": [
          "Учредительный устав (Constitution) Фонда МСФО",
          "Концептуальная основа",
          "План счетов",
          "Закон о бухгалтерском учете"
        ],
        "correct": 0
      },
      {
        "question": "Что представляет собой МСФО (IFRS) для МСП?",
        "answers": [
          "Упрощенные международные стандарты финансовой отчетности для малых и средних предприятий",
          "Стандарты аудита",
          "Национальные стандарты бухгалтерского учета",
          "Инструкции по налогообложению"
        ],
        "correct": 0
      }
    ]
  },
  {
    "id": 7,
    "title": "Блок 7",
    "questions": [
      {
        "question": "Когда была опубликована первая версия МСФО для МСП?",
        "answers": [
          "В 2009 году",
          "В 2012 году",
          "В 2010 году",
          "В 2005 году"
        ],
        "correct": 0
      },
      {
        "question": "Кто несет ответственность за подготовку финансовой отчетности предприятия?",
        "answers": [
          "Министерство финансов",
          "Руководство предприятия",
          "Государственный налоговый орган",
          "Аудиторская компания"
        ],
        "correct": 1
      },
      {
        "question": "Какой документ регулирует аудит финансовой отчетности?",
        "answers": [
          "Международные стандарты аудита (МСА)",
          "МСФО (IAS)",
          "План счетов бухгалтерского учета",
          "МСФО (IFRS)"
        ],
        "correct": 0
      },
      {
        "question": "Как называется отчет, предоставляющий информацию об источниках и использовании денежных средств?",
        "answers": [
          "Отчет об изменениях капитала",
          "Бухгалтерский баланс",
          "Отчет о прибылях и убытках",
          "Отчет о движении денежных средств"
        ],
        "correct": 3
      },
      {
        "question": "Какая организация утверждает международные стандарты аудита (МСА)?",
        "answers": [
          "Европейская комиссия",
          "Всемирный банк",
          "Международная федерация бухгалтеров (IFAC)",
          "Совет по МСФО (IASB)"
        ],
        "correct": 2
      },
      {
        "question": "Какая цель проведения аудита финансовой отчетности?",
        "answers": [
          "Проверка соблюдения налогового законодательства",
          "Контроль за расходованием бюджета",
          "Проверка бухгалтерских записей",
          "Выражение мнения аудитора о достоверности финансовой отчетности предприятия"
        ],
        "correct": 3
      },
      {
        "question": "Что понимается под существенностью информации?",
        "answers": [
          "Информация, которая обязательна для раскрытия в примечаниях",
          "Информация считается существенной, если ее пропуск или искажение может повлиять на экономические решения пользователей.",
          "Данные, относящиеся к налоговым обязательствам",
          "Информация о кредиторской задолженности"
        ],
        "correct": 1
      },
      {
        "question": "Какой элемент финансовой отчетности отражает экономические выгоды, контролируемые предприятием?",
        "answers": [
          "Капитал",
          "Активы",
          "Обязательства",
          "Доходы"
        ],
        "correct": 1
      },
      {
        "question": "Какой элемент финансовой отчетности отражает текущие и будущие долги предприятия?",
        "answers": [
          "Обязательства",
          "Капитал",
          "Активы",
          "Доходы"
        ],
        "correct": 0
      },
      {
        "question": "Что представляет собой капитал предприятия?",
        "answers": [
          "Сумма амортизации",
          "Выручка от основной деятельности",
          "Оставшаяся доля активов после вычета всех обязательств",
          "Сумма активов предприятия"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 19?",
        "answers": [
          "Инвестиции",
          "Основные средства",
          "Финансовые инструменты",
          "Вознаграждения работникам"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 20?",
        "answers": [
          "Учет государственных субсидий и раскрытие информации о государственной помощи",
          "Учет Финансовая аренда",
          "Учет Запасы",
          "Учет Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 21?",
        "answers": [
          "Учет инвестиции",
          "Учет резервов",
          "Учет выручки",
          "Влияние изменений валютных курсов"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 23?",
        "answers": [
          "Резервы",
          "Инвестиции",
          "Финансовые инструменты",
          "Затраты по займам"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 24?",
        "answers": [
          "Раскрытие информации о связанных сторонах",
          "Финансовые инструменты",
          "Основные средства",
          "Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 26?",
        "answers": [
          "Учет и отчетность пенсионных планов",
          "Инвестиции",
          "Резервы",
          "Выручка"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 27?",
        "answers": [
          "Финансовые инструменты",
          "Консолидированная отчетность",
          "Отдельная финансовая отчетность",
          "Основные средства"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 28?",
        "answers": [
          "Инвестиции главный компании",
          "Инвестиции в ассоциированные и совместные предприятия",
          "Резервы дочерний организации",
          "Финансовая аренда все дочерних организации"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 29?",
        "answers": [
          "Финансовая отчетность в условиях гиперинфляции",
          "Основные средства",
          "Резервы",
          "Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 32?",
        "answers": [
          "Представление финансовых инструментов",
          "Основные средства",
          "Выручка",
          "Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 33?",
        "answers": [
          "Резервы",
          "Финансовая аренда",
          "Инвестиции",
          "Прибыль на акцию"
        ],
        "correct": 3
      },
      {
        "question": "Что регулирует МСФО (IAS) 34?",
        "answers": [
          "Промежуточная финансовая отчетность",
          "Резервы",
          "Финансовые инструменты",
          "Инвестиции"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 35?",
        "answers": [
          "Инвестиции",
          "Прекращенная деятельность",
          "Выручка",
          "Финансовые инструменты"
        ],
        "correct": 1
      },
      {
        "question": "Что регулирует МСФО (IAS) 36?",
        "answers": [
          "Резервы",
          "Инвестиции",
          "Обесценение активов",
          "Основные средства"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 37?",
        "answers": [
          "Финансовая аренда",
          "Резервы, условные обязательства и условные активы",
          "Инвестиции",
          "Резервы"
        ],
        "correct": 1
      }
    ]
  },
  {
    "id": 8,
    "title": "Блок 8",
    "questions": [
      {
        "question": "Что регулирует МСФО (IAS) 38?",
        "answers": [
          "Финансовые инструменты",
          "Основные средства",
          "Нематериальные активы",
          "Инвестиции"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 39?",
        "answers": [
          "Признание и оценка финансовых инструментов",
          "Резервы",
          "Инвестиции",
          "Выручка"
        ],
        "correct": 0
      },
      {
        "question": "Что регулирует МСФО (IAS) 40?",
        "answers": [
          "Инвестиции",
          "Финансовые инструменты",
          "Инвестиционная недвижимость",
          "Резервы"
        ],
        "correct": 2
      },
      {
        "question": "Что регулирует МСФО (IAS) 41?",
        "answers": [
          "Резервы",
          "Сельское хозяйство",
          "Финансовая аренда",
          "Выручка"
        ],
        "correct": 1
      },
      {
        "question": "Какая цель внедрения МСФО в Республике Узбекистан?",
        "answers": [
          "Увеличение прибыли компаний",
          "Повышение прозрачности и сопоставимости финансовой отчетности предприятий",
          "Снижение налоговых ставок",
          "Сокращение расходов бюджета"
        ],
        "correct": 1
      },
      {
        "question": "Какая организация в Узбекистане отвечает за внедрение и контроль МСФО?",
        "answers": [
          "Министерство экономики и финансов Республики Узбекистан",
          "Госкомстат",
          "Министерство юстиции",
          "Центральный банк"
        ],
        "correct": 0
      },
      {
        "question": "С какого года в Узбекистане начат переход на МСФО?",
        "answers": [
          "С 2018 года",
          "С 2021 года",
          "С 2015 года",
          "С 2023 года"
        ],
        "correct": 1
      },
      {
        "question": "Какие предприятия в первую очередь обязаны применять МСФО в Узбекистане?",
        "answers": [
          "Малые предприятия",
          "Все частные компании",
          "Крупные и публичные предприятия, а также организации с иностранным участием",
          "Образовательные учреждения"
        ],
        "correct": 2
      },
      {
        "question": "Какой отчет содержит информацию о финансовых результатах деятельности предприятия?",
        "answers": [
          "Отчет о движении денежных средств",
          "Отчет о прибылях и убытках",
          "Бухгалтерский баланс",
          "Отчет об изменениях капитала"
        ],
        "correct": 1
      },
      {
        "question": "Как определяется сумма затрат по капитализируемым займам?",
        "answers": [
          "сумма затрат по капитализируемым займам = затраты на актив * ставка капитализации",
          "сумма затрат по капитализируемым займам = доход в виде процентов * ставка капитализации",
          "сумма затрат по капитализируемым займам = затраты, произведенные на актив * доход в виде процентов",
          "сумма затрат по капитализируемым займам = затраты по активу / ставка капитализации"
        ],
        "correct": 0
      },
      {
        "question": "В соответствии с каким международно-правовым документом регулируется отдельная финансовая отчетность?",
        "answers": [
          "МСФО (IFRS) 3",
          "МСФО (IAS) 27",
          "МСФО (IAS) 10",
          "МСФО (IAS) 28"
        ],
        "correct": 1
      },
      {
        "question": "В соответствии с каким международно-правовым документом регулируются инвестиции в подведомственные организации?",
        "answers": [
          "МСФО (IFRS) 3",
          "МСФО (IAS) 10",
          "МСФО (IAS) 27",
          "МСФО (IAS) 28"
        ],
        "correct": 3
      },
      {
        "question": "Согласно какому международному нормативно-правовому документу регулируются хозяйственные процессы, связанные с объединениями бизнеса?",
        "answers": [
          "МСФО (IAS) 10",
          "МСФО (IAS) 27",
          "МСФО (IAS) 28",
          "МСФО (IFRS) 3"
        ],
        "correct": 3
      },
      {
        "question": "В соответствии с каким международным нормативным правовым документом регулируется консолидированная финансовая отчетность?",
        "answers": [
          "МСФО (IAS) 28",
          "МСФО (IFRS) 10",
          "МСФО 11",
          "МСФО (IAS) 27"
        ],
        "correct": 1
      },
      {
        "question": "Согласно какому международному нормативно-правовому документу регулируются соглашения о совместной деятельности?",
        "answers": [
          "МСФО (IFRS) 10",
          "МСФО (IAS) 28",
          "МСФО (IAS) 27",
          "МСФО (IFRS) 11"
        ],
        "correct": 3
      },
      {
        "question": "Согласно какому международному нормативно-правовому документу регулируется раскрытие долей в других организациях?",
        "answers": [
          "МСФО (IFRS) 10",
          "МСФО (IAS) 27",
          "МСФО 12",
          "МСФО (IAS) 28"
        ],
        "correct": 2
      },
      {
        "question": "Какой процент доли дочернего предприятия владеет головной компанией, что считается полной консолидацией?",
        "answers": [
          "50%",
          "80%",
          "20%",
          "10%"
        ],
        "correct": 0
      },
      {
        "question": "Как называются существующие права, позволяющие оказывать влияние на соответствующую деятельность?",
        "answers": [
          "полномочия",
          "Простое право",
          "контроль",
          "консолидация"
        ],
        "correct": 0
      },
      {
        "question": "Как называется финансовая отчетность группы, представленная в качестве финансовой отчетности единой экономической организации?",
        "answers": [
          "Переменная финансовая отчетность",
          "Общий отчет",
          "Отдельная финансовая отчетность",
          "Консолидированная финансовая отчетность"
        ],
        "correct": 3
      },
      {
        "question": "В сколько этапов осуществляется консолидированная финансовая отчетность?",
        "answers": [
          "3.",
          "6.",
          "4.",
          "5"
        ],
        "correct": 3
      },
      {
        "question": "Какие расчеты производятся на первом этапе консолидации финансовой отчетности?",
        "answers": [
          "Расчет стоимости чистых активов дочернего предприятия, принадлежащего головному предприятию, на дату приобретения и отчетную дату",
          "Доля головного предприятия, не имеющая контрольной силы в отношении дочернего предприятия",
          "Головной компанией определяется гудвил на дату приобретения дочерней компании и на отчетную дату.",
          "Определение количества дочерних предприятий, в которые инвестировало головное предприятие, и определение даты инвестирования в дочернее предприятие и доли в дочернем предприятии"
        ],
        "correct": 3
      },
      {
        "question": "Какие расчеты производятся на втором этапе консолидации финансовой отчетности?",
        "answers": [
          "Определяется количество дочерних предприятий, в которые инвестировало головное предприятие, и дата инвестирования в дочернее предприятие, а также доля в дочернем предприятии.",
          "Головной компанией определяется гудвил на дату приобретения дочерней компании и на отчетную дату.",
          "Доля головного предприятия, не имеющая контрольной силы в отношении дочернего предприятия",
          "Расчет стоимости чистых активов дочернего предприятия, принадлежащего головному предприятию, на дату приобретения и отчетную дату"
        ],
        "correct": 3
      },
      {
        "question": "Какие расчеты производятся на третьем этапе консолидации финансовой отчетности?",
        "answers": [
          "Определяется количество дочерних предприятий, в которые инвестировало головное предприятие, и дата инвестирования в дочернее предприятие, а также доля в дочернем предприятии.",
          "Доля головного предприятия, не имеющая контрольной силы в отношении дочернего предприятия",
          "Стоимость чистых активов дочернего предприятия, принадлежащего головному предприятию, на дату приобретения и отчетную дату.",
          "Главная компания определяет гудвил на дату приобретения дочерней компании и на отчетную дату"
        ],
        "correct": 3
      },
      {
        "question": "Какой расчет осуществляется на 4-м этапе консолидации финансовой отчетности?",
        "answers": [
          "Стоимость чистых активов дочернего предприятия, принадлежащего головному предприятию, на дату приобретения и отчетную дату.",
          "Головной компанией определяется гудвил на дату приобретения дочерней компании и на отчетную дату.",
          "Доля головной компании, не имеющая контрольной силы по отношению к дочерней компании",
          "Определяется количество дочерних предприятий, в которые инвестировало головное предприятие, и дата инвестирования в дочернее предприятие, а также доля в дочернем предприятии."
        ],
        "correct": 2
      },
      {
        "question": "Какой расчет осуществляется на 5-м этапе консолидации финансовой отчетности?",
        "answers": [
          "Определяется количество дочерних предприятий, в которые инвестировало головное предприятие, и дата инвестирования в дочернее предприятие, а также доля в дочернем предприятии.",
          "Головной компанией определяется гудвил на дату приобретения дочерней компании и на отчетную дату.",
          "Стоимость чистых активов дочернего предприятия, принадлежащего головному предприятию, на дату приобретения и отчетную дату.",
          "Группа рассчитывает нераспределенную прибыль"
        ],
        "correct": 3
      }
    ]
  },
  {
    "id": 9,
    "title": "Блок 9",
    "questions": [
      {
        "question": "Когда было принято Постановление Президента Республики Узбекистан Ш.Мирзиёева \"О дополнительных мерах по переходу на международные стандарты финансовой отчетности\"?",
        "answers": [
          "24 февраля 2020 г.",
          "24 апреля 2015 г.",
          "4 февраля 2017 г.",
          "13 апреля 2016 г."
        ],
        "correct": 0
      },
      {
        "question": "В каком документе указано, что \"требования к финансовой отчетности, составляемой по международным стандартам, определяются международными стандартами финансовой отчетности\"?",
        "answers": [
          "Налоговым кодексом",
          "В НСБУ",
          "В статье 22 Закона \"О бухгалтерском учете\" в новой редакции,",
          "В Трудовом кодексе"
        ],
        "correct": 2
      },
      {
        "question": "Как называется существующий экономический ресурс, контролируемый организацией в результате предыдущих событий?",
        "answers": [
          "Капитал",
          "Актив",
          "Обязательство",
          "Пассивный"
        ],
        "correct": 1
      },
      {
        "question": "В соответствии с МСФО Какие из следующих элементов непосредственно связаны с измерением прибыли в соответствии с Концептуальными основаниями?",
        "answers": [
          "Чистый актив",
          "Обязательства и капитал",
          "Доход",
          "Доходы и расходы"
        ],
        "correct": 3
      },
      {
        "question": "Чему равны чистые активы компании?",
        "answers": [
          "Денежные средства",
          "В частный капитал",
          "В уставный капитал",
          "На чистую прибыль"
        ],
        "correct": 1
      },
      {
        "question": "Какое из следующих уравнений представляет собой расширенную форму уравнения баланса?",
        "answers": [
          "Активы - Расходы = Обязательства + Собственный капитал - Доходы",
          "Активы + Расходы = Обязательства + Собственный капитал",
          "Активы + Расходы = Собственный капитал + Доходы",
          "Активы + Расходы = Обязательства + Собственный капитал + Доходы"
        ],
        "correct": 3
      },
      {
        "question": "Как называется существующая ответственность организации за передачу экономического ресурса, возникшего в результате предыдущих событий?",
        "answers": [
          "Расход",
          "Активный",
          "Капитал",
          "Обязательство"
        ],
        "correct": 3
      },
      {
        "question": "Чему равна остаточная доля в активах организации после вычета всех ее обязательств?",
        "answers": [
          "Активный",
          "Обязательство",
          "Доход",
          "Собственный капитал"
        ],
        "correct": 3
      },
      {
        "question": "Денежные средства, поступившие от покупателя в результате реализации товаров:",
        "answers": [
          "Денежный поток операционной деятельности",
          "Денежный поток инвестиционной деятельности",
          "Инвестиционная и финансовая деятельность",
          "Денежный поток операционной или финансовой деятельности"
        ],
        "correct": 0
      },
      {
        "question": "Поступление денежных средств от реализации Компанией собственного автотранспортного средства осуществляется:",
        "answers": [
          "Инвестиционная и финансовая деятельность",
          "Денежный поток операционной деятельности",
          "Денежный поток инвестиционной деятельности",
          "Денежный поток финансовой деятельности"
        ],
        "correct": 2
      },
      {
        "question": "В какой финансовой отчетности отражаются расходы по финансовой деятельности?",
        "answers": [
          "В отчете о собственном капитале",
          "В отчете о финансовом положении",
          "В отчете о движении денежных средств",
          "В отчете о прибылях и убытках"
        ],
        "correct": 3
      },
      {
        "question": "В какой финансовой отчётности отражаются расходы по убыткам от обесценения активов?",
        "answers": [
          "В отчете о собственном капитале",
          "В отчете о финансовом положении",
          "В отчете о движении денежных средств",
          "В отчете о прибылях и убытках"
        ],
        "correct": 3
      },
      {
        "question": "Как называется сумма налога на прибыль, уплачиваемая по налогооблагаемой прибыли за период?",
        "answers": [
          "отсроченные налоги",
          "текущий налог",
          "отложенные налоговые активы",
          "отсроченные налоговые обязательства"
        ],
        "correct": 1
      },
      {
        "question": "Как называется сумма налога на прибыль, уплачиваемая в будущие периоды по временным налогооблагаемым разницам?",
        "answers": [
          "текущий налог",
          "отсроченные налоги",
          "отложенных налоговых обязательств",
          "отложенные налоговые активы"
        ],
        "correct": 2
      },
      {
        "question": "Чему равна суммарная сумма, учтенная при определении прибыли или убытка периода по текущему и отложенному налогу?",
        "answers": [
          "расходы на налог на прибыль",
          "Бухгалтерcкая прибыль",
          "Налогооблагаемая прибыль",
          "На временную разницу"
        ],
        "correct": 0
      },
      {
        "question": "Прибыль (убыток) рассчитывается за период, определяемый (определяемый) налоговыми органами в соответствии с установленными правилами и в результате которого уплачивается (возмещается) налог на прибыль. Как называется прибыль?",
        "answers": [
          "Временная прибыль",
          "Налогооблагаемая прибыль",
          "Чистая прибыль",
          "Бухгалтерская прибыль"
        ],
        "correct": 1
      },
      {
        "question": "Как называется разница между балансовой стоимостью актива или обязательства, отраженной в отчете о финансовом положении, и его налоговой базой?",
        "answers": [
          "Вычитаемая разница",
          "Отсроченная разница",
          "Постоянная разница",
          "временная разница"
        ],
        "correct": 3
      },
      {
        "question": "Как называется договор или часть договора, предоставляющая право пользования активом в течение определенного периода времени в обмен на компенсацию?",
        "answers": [
          "аренда",
          "Финансовый инструмент",
          "Финансовое обязательство",
          "Финансовый актив"
        ],
        "correct": 0
      },
      {
        "question": "Установить принципы определения и представления прибыли на акцию с целью облегчения сопоставления результатов деятельности одной организации за разные отчетные периоды или результатов деятельности разных организаций за один отчетный период.",
        "answers": [
          "МСФО 12",
          "МСФО 32",
          "МСФО 33",
          "МСФО 9"
        ],
        "correct": 2
      },
      {
        "question": "Какие показатели существуют для определения прибыли на акцию?",
        "answers": [
          "базовый, средневзвешенный, разбавленный",
          "базовый",
          "базовый и разбавленный",
          "разбавленный"
        ],
        "correct": 2
      },
      {
        "question": "Что из перечисленного не является квалифицируемым активом?",
        "answers": [
          "финансовые активы",
          "нематериальный актив",
          "Инвестиционная недвижимость",
          "запас"
        ],
        "correct": 0
      },
      {
        "question": "Как называется прибыль или убыток до вычета расходов по налогу на прибыль за период?",
        "answers": [
          "бухгалтерская прибыль",
          "временная прибыль",
          "чистая прибыль",
          "налогооблагаемая прибыль"
        ],
        "correct": 0
      },
      {
        "question": "Как называются временные разницы, порождающие налогооблагаемые суммы при расчете налогооблагаемой прибыли (налогового убытка) будущих периодов, по которым возмещается или погашается балансовая стоимость соответствующего актива или обязательства?",
        "answers": [
          "Вычитаемые временные разницы",
          "Отсроченные разницы",
          "Временные разницы",
          "Налогооблагаемые временные разницы"
        ],
        "correct": 3
      },
      {
        "question": "Как называются временные разницы, которые приводят к вычитаемым суммам при расчете налогооблагаемой прибыли (налогового убытка) будущих периодов, по которым возмещается или погашается балансовая стоимость соответствующего актива или обязательства?",
        "answers": [
          "Временные различия",
          "Временные налогооблагаемые разницы",
          "Отсроченные различия",
          "Вычитаемые временные разницы"
        ],
        "correct": 3
      },
      {
        "question": "На сколько этапов целесообразно определять расходы по налогу на прибыль по отсроченным налогам в соответствии с МСФО 12?",
        "answers": [
          "3.",
          "4",
          "2.",
          "5."
        ],
        "correct": 1
      }
    ]
  },
  {
    "id": 10,
    "title": "Блок 10",
    "questions": [
      {
        "question": "Как называется разница между налогооблагаемой прибылью и бухгалтерской прибылью, возникающая в текущем отчетном периоде и не пересчитываемая в последующих периодах?",
        "answers": [
          "постоянная разница",
          "Вычитаемая временная разница",
          "Временная разница",
          "Отсроченная разница"
        ],
        "correct": 0
      },
      {
        "question": "Может ли предприятие получать доход в результате уменьшения обязательств?",
        "answers": [
          "Нет, это невозможно",
          "Возникают только расходы",
          "да возможно",
          "Обязательство не связано с доходом"
        ],
        "correct": 2
      },
      {
        "question": "Какие объекты считаются инвестиционной недвижимостью по МСФО 40?",
        "answers": [
          "Жилые помещения, занятые собственниками",
          "Здания и земельные участки, используемые для собственной производственной деятельности",
          "Недвижимость, удерживаемая для сдачи в аренду или для последующей продажи с целью получения дохода",
          "Любая недвижимость компании"
        ],
        "correct": 2
      },
      {
        "question": "Как следует учитывать первоначальные затраты на приобретение инвестиционной недвижимости?",
        "answers": [
          "Включать цену покупки и прямые затраты на приобретение",
          "Отражать сразу на счетах расходов",
          "Оценивать по справедливой стоимости с первого дня",
          "Включать только цену покупки"
        ],
        "correct": 0
      },
      {
        "question": "Какие модели последующей оценки допускаются для инвестиционной недвижимости?",
        "answers": [
          "Либо справедливая стоимость, либо модель стоимости за вычетом амортизации с отдельным признанием обесценения",
          "Только справедливая стоимость с отражением изменений в прибыли или убытке",
          "Только модель стоимости за вычетом амортизации",
          "Любая модель на усмотрение компании"
        ],
        "correct": 0
      },
      {
        "question": "Как изменения справедливой стоимости отражаются в финансовой отчетности при использовании модели справедливой стоимости?",
        "answers": [
          "В отчете о прибылях и убытках за период",
          "В составе прочего совокупного дохода",
          "На счете капитала без влияния на прибыль",
          "Не отражаются до момента продажи"
        ],
        "correct": 0
      },
      {
        "question": "Какая недвижимость не подпадает под МСФО 40?",
        "answers": [
          "Складское помещение, используемое для хранения сырья компании",
          "Офисное здание, сданное в аренду",
          "Жилое помещение, сдаваемое в аренду",
          "Земельный участок, удерживаемый для увеличения стоимости"
        ],
        "correct": 0
      },
      {
        "question": "Можно ли использовать модель амортизированной стоимости для инвестиционной недвижимости?",
        "answers": [
          "Да, но только если справедливая стоимость не может быть надежно измерена",
          "Только для земельных участков",
          "Нет, это запрещено МСФО 40",
          "Да, для всех видов инвестиционной недвижимости"
        ],
        "correct": 0
      },
      {
        "question": "Как учитывать капитальные и ремонтные затраты на инвестиционную недвижимость?",
        "answers": [
          "Не отражаются в учете",
          "Все затраты капитализируются",
          "Капитализируются затраты, увеличивающие будущие экономические выгоды, текущие расходы списываются",
          "Все затраты списываются на расходы текущего периода"
        ],
        "correct": 2
      },
      {
        "question": "Как отражается выбытие инвестиционной недвижимости?",
        "answers": [
          "Только списание амортизации",
          "Не отражается",
          "Списание балансовой стоимости с признанием прибыли или убытка",
          "Только перенос на счет капитала"
        ],
        "correct": 2
      },
      {
        "question": "Как определяется справедливая стоимость инвестиционной недвижимости?",
        "answers": [
          "Стоимость приобретения с добавлением затрат на ремонт",
          "Плановая стоимость строительства объекта",
          "Цена, по которой объект может быть продан на открытом рынке между заинтересованными сторонами",
          "Балансовая стоимость за вычетом амортизации"
        ],
        "correct": 2
      },
      {
        "question": "Как часто требуется переоценка инвестиционной недвижимости при применении модели справедливой стоимости?",
        "answers": [
          "По мере необходимости, но не реже одного раза в год",
          "Один раз при приобретении",
          "Переоценка не требуется",
          "Каждые 5 лет"
        ],
        "correct": 0
      },
      {
        "question": "Основная цель МСФО 5:",
        "answers": [
          "Учесть запасы",
          "Рассчитать амортизацию",
          "Определить себестоимость",
          "Отразить долгосрочные активы, предназначенные для продажи, и прекращаемую деятельность"
        ],
        "correct": 3
      },
      {
        "question": "Актив признаётся предназначенным для продажи, если:",
        "answers": [
          "Его амортизация завершена",
          "Его стоимость будет реализована преимущественно через продажу",
          "Он полностью списан",
          "Он используется в основной деятельности"
        ],
        "correct": 1
      },
      {
        "question": "Условие для классификации актива как предназначенного для продажи:",
        "answers": [
          "Продажа может произойти через 5 лет",
          "Обесценен полностью",
          "Продажа ожидается в течение года",
          "Используется в производстве"
        ],
        "correct": 2
      },
      {
        "question": "После классификации актива предназначенного для продажи:",
        "answers": [
          "По исторической стоимости",
          "По себестоимости",
          "Он измеряется по меньшей из балансовой стоимости и справедливой стоимости минус расходы на продажу",
          "По амортизированной стоимости"
        ],
        "correct": 2
      },
      {
        "question": "Прекращаемая деятельность — это:",
        "answers": [
          "Основная деятельность",
          "Компонент компании, который был продан или классифицирован для продажи",
          "Краткосрочные обязательства",
          "Запасы"
        ],
        "correct": 1
      },
      {
        "question": "Доходы от прекращаемой деятельности показываются:",
        "answers": [
          "Вместе с операционной прибылью",
          "Не показываются",
          "Отдельно в отчёте о прибылях и убытках",
          "В капитале"
        ],
        "correct": 2
      },
      {
        "question": "Потери от обесценения актива для продажи:",
        "answers": [
          "Признаются сразу в прибыли или убытке",
          "Как увеличение амортизации",
          "В капитале",
          "Не признаются"
        ],
        "correct": 0
      },
      {
        "question": "Расходы на продажу включают:",
        "answers": [
          "Амортизацию",
          "Прямые расходы, связанные с продажей актива",
          "Общие административные расходы",
          "Заработную плату"
        ],
        "correct": 1
      },
      {
        "question": "Долгосрочный актив для продажи не амортизируется:",
        "answers": [
          "После продажи",
          "Всегда",
          "До продажи",
          "С момента классификации как предназначенного для продажи"
        ],
        "correct": 3
      },
      {
        "question": "Как определяется справедливая стоимость минус расходы на продажу?",
        "answers": [
          "Историческая стоимость",
          "Балансовая стоимость",
          "Амортизированная стоимость",
          "Ожидаемая цена продажи за вычетом затрат на продажу"
        ],
        "correct": 3
      },
      {
        "question": "Классификация прекращаемой деятельности проводится, если:",
        "answers": [
          "Деятельность приносит прибыль",
          "Деятельность ведётся менее года",
          "Ожидается её отчуждение или прекращение",
          "Она полностью амортизирована"
        ],
        "correct": 2
      },
      {
        "question": "Потери от обесценения включают:",
        "answers": [
          "Себестоимость",
          "Доход",
          "Разницу между балансовой стоимостью и справедливой стоимостью минус расходы на продажу",
          "Амортизацию"
        ],
        "correct": 2
      },
      {
        "question": "Прекращаемая деятельность раскрывается:",
        "answers": [
          "В капитале",
          "В активах",
          "В обязательствах",
          "В отчёте о прибылях и убытках отдельной строкой"
        ],
        "correct": 3
      }
    ]
  },
  {
    "id": 11,
    "title": "Блок 11",
    "questions": [
      {
        "question": "Критерий для продажи актива:",
        "answers": [
          "Может быть использован в течение нескольких лет",
          "Актив доступен для немедленной продажи в его текущем состоянии",
          "Не обесценен",
          "Списан"
        ],
        "correct": 1
      },
      {
        "question": "Основная цель раскрытия информации по МСФО 5:",
        "answers": [
          "Дать пользователям отчётности ясную информацию о прекращаемой деятельности и активах для продажи",
          "Показать амортизацию",
          "Уменьшить налоговую базу",
          "Увеличить капитал"
        ],
        "correct": 0
      },
      {
        "question": "Основная цель МСФО 23:",
        "answers": [
          "Определить порядок учёта затрат по займам, которые напрямую относятся к приобретению, строительству или производству квалифицируемого актива",
          "Учёт расходов на рекламу",
          "Учёт амортизации",
          "Учёт зарплаты"
        ],
        "correct": 0
      },
      {
        "question": "Квалифицируемый актив — это:",
        "answers": [
          "Текущий актив",
          "Актив, требующий значительного времени для подготовки к использованию или продаже",
          "Основные средства для немедленного использования",
          "Простой запас"
        ],
        "correct": 1
      },
      {
        "question": "Затраты по займам включают:",
        "answers": [
          "Расходы на аренду",
          "Амортизацию",
          "Административные расходы",
          "Проценты по заемным средствам, использованным для приобретения квалифицируемого актива"
        ],
        "correct": 3
      },
      {
        "question": "Начало капитализации затрат по займам — это:",
        "answers": [
          "Когда актив введён в эксплуатацию",
          "Когда предприятие понесло расходы по займам и начало работы по активу",
          "Когда куплены материалы",
          "Когда получена прибыль"
        ],
        "correct": 1
      },
      {
        "question": "Прекращение капитализации — это:",
        "answers": [
          "Когда выручка получена",
          "Когда начислена амортизация",
          "Когда актив готов к использованию или продаже",
          "Когда актив продан"
        ],
        "correct": 2
      },
      {
        "question": "Затраты по займам учитываются:",
        "answers": [
          "В прибыли и убытке",
          "В капитале",
          "Как обязательство",
          "В балансе как часть стоимости квалифицируемого актива"
        ],
        "correct": 3
      },
      {
        "question": "Для активов, которые не являются квалифицируемыми, затраты по займам:",
        "answers": [
          "Сразу списываются в расходы",
          "Увеличивают капитал",
          "Капитализируются",
          "Переносятся на будущие периоды"
        ],
        "correct": 0
      },
      {
        "question": "Если заем использован частично для квалифицируемого актива:",
        "answers": [
          "Все проценты капитализируются",
          "Увеличивают обязательства",
          "Капитализируются только проценты, относящиеся к активу",
          "Не капитализируются"
        ],
        "correct": 2
      },
      {
        "question": "Средневзвешенная стоимость заимствований применяется для:",
        "answers": [
          "Расчёта капитализируемых затрат по займам",
          "Определения амортизации",
          "Определения налога",
          "Расчёта выручки"
        ],
        "correct": 0
      },
      {
        "question": "Цель капитализации:",
        "answers": [
          "Уменьшить налоговую нагрузку",
          "Увеличить прибыль",
          "Отразить полную стоимость актива, включая расходы на заёмные средства",
          "Показать обязательства"
        ],
        "correct": 2
      },
      {
        "question": "Капитализация не начинается до:",
        "answers": [
          "Получения займа",
          "Начала работ по активу",
          "Получения прибыли",
          "Конца отчётного периода"
        ],
        "correct": 1
      },
      {
        "question": "Как отражаются расходы по займам до начала капитализации?",
        "answers": [
          "Капитализируются",
          "Увеличивают обязательства",
          "Сразу в расходы периода",
          "Переносятся на будущие периоды"
        ],
        "correct": 2
      },
      {
        "question": "Если актив частично используется, капитализация:",
        "answers": [
          "Применяется только к доле активов в эксплуатации",
          "Прекращается, когда актив готов к использованию",
          "Не применяется",
          "Продолжается"
        ],
        "correct": 1
      },
      {
        "question": "Проценты по займам, превышающие капитализацию, отражаются:",
        "answers": [
          "Капитализируются",
          "Увеличивают стоимость актива",
          "Переносятся на следующий год",
          "Как расходы периода"
        ],
        "correct": 3
      },
      {
        "question": "Основная цель раскрытия информации по МСФО 23:",
        "answers": [
          "информацию о затратах по займам,",
          "Определить выручку",
          "Увеличить капитал",
          "Показать амортизацию"
        ],
        "correct": 0
      },
      {
        "question": "Основная цель МСФО 21:",
        "answers": [
          "Определить амортизацию активов",
          "Установить правила расчёта прибыли",
          "Отразить влияние изменений валютных курсов на финансовую отчётность",
          "Регулировать доходы от продаж"
        ],
        "correct": 2
      },
      {
        "question": "Какой курс используется для пересчёта активов и обязательств на дату отчёта?",
        "answers": [
          "Курс на дату баланса",
          "Исторический курс",
          "Любой курс по выбору",
          "Средний за год"
        ],
        "correct": 0
      },
      {
        "question": "Доходы и расходы в иностранной валюте пересчитываются по:",
        "answers": [
          "Курсу на дату операции",
          "Курсу на конец года",
          "Среднему курсу за период",
          "Исторической стоимости"
        ],
        "correct": 0
      },
      {
        "question": "Курс на дату баланса применяется для:",
        "answers": [
          "Основных средств",
          "Себестоимости запасов",
          "Денежных активов и обязательств",
          "Нематериальных активов"
        ],
        "correct": 2
      },
      {
        "question": "Обменные разницы, возникающие при пересчёте валюты:",
        "answers": [
          "Отражаются в прибыли или убытке",
          "Увеличивают активы",
          "Уменьшают обязательства",
          "Списываются напрямую в капитал"
        ],
        "correct": 0
      },
      {
        "question": "Для немонетарных статей в иностранной валюте применяется:",
        "answers": [
          "Текущий курс",
          "Курс на дату отчёта",
          "Исторический курс",
          "Средний за период"
        ],
        "correct": 2
      },
      {
        "question": "Монетарные активы — это:",
        "answers": [
          "Запасы",
          "Денежные средства и дебиторская задолженность",
          "Нематериальные активы",
          "Основные средства"
        ],
        "correct": 1
      },
      {
        "question": "Монетарные обязательства включают:",
        "answers": [
          "Основные средства",
          "Кредиты и обязательства поставщикам",
          "Запасы",
          "Нематериальные активы"
        ],
        "correct": 1
      }
    ]
  },
  {
    "id": 12,
    "title": "Блок 12",
    "questions": [
      {
        "question": "Если иностранная валюта ослабевает, это приводит к:",
        "answers": [
          "Обменной разнице в прибыли или убытке",
          "Уменьшению обязательств без прибыли/убытка",
          "Пересчёту исторической стоимости",
          "Увеличению активов на балансе"
        ],
        "correct": 0
      },
      {
        "question": "Пересчёт иностранной валюты для отчётности консолидированных компаний проводится:",
        "answers": [
          "По курсу последней операции",
          "По курсу на дату создания дочерней компании",
          "По курсу на дату баланса",
          "По среднему курсу года основания"
        ],
        "correct": 2
      },
      {
        "question": "Что относится к немонетарным статьям?",
        "answers": [
          "Дебиторская задолженность",
          "Денежные средства",
          "Основные средства, запасы",
          "Кредиты банка"
        ],
        "correct": 2
      },
      {
        "question": "Обменные разницы по долгосрочным обязательствам отражаются:",
        "answers": [
          "В прибыли или убытке",
          "Как расходы будущих периодов",
          "В капитале",
          "Не учитываются"
        ],
        "correct": 0
      },
      {
        "question": "Приобретение актива в иностранной валюте признаётся по:",
        "answers": [
          "Курсу на конец года",
          "Курсу на дату приобретения",
          "Любому курсу",
          "Среднему курсу месяца"
        ],
        "correct": 1
      },
      {
        "question": "Обменные разницы на валютные кредиты отражаются:",
        "answers": [
          "В отчёте о прибылях и убытках",
          "В капитале",
          "Списываются",
          "Как увеличение активов"
        ],
        "correct": 0
      },
      {
        "question": "Цель МСФО 21 — это:",
        "answers": [
          "Дать точную оценку влияния колебаний валют на финансовую отчётность",
          "Распределить дивиденды",
          "Определить амортизацию",
          "Установить налог на прибыль"
        ],
        "correct": 0
      },
      {
        "question": "Как учитываются затраты на исследование?",
        "answers": [
          "Переносятся на будущие периоды",
          "Учитываются как обязательство",
          "Капитализируются",
          "Всегда списываются в расходы периода"
        ],
        "correct": 3
      },
      {
        "question": "Что необходимо для признания НМА?",
        "answers": [
          "Контроль, будущие выгоды и возможность оценки",
          "Только наличие договора",
          "Только доходность",
          "Только полезность"
        ],
        "correct": 0
      },
      {
        "question": "Какой метод амортизации применим к НМА?",
        "answers": [
          "Только производственный метод",
          "Любой метод по выбору бухгалтера без обоснования",
          "Только линейный метод",
          "Любой систематический метод, отражающий потребление выгод"
        ],
        "correct": 3
      },
      {
        "question": "Можно ли капитализировать внутренний гудвилл?",
        "answers": [
          "Да, если компания прибыльная",
          "Нет",
          "Да",
          "Да, если актив оценён экспертами"
        ],
        "correct": 1
      },
      {
        "question": "Как учитывать последующие затраты по НМА?",
        "answers": [
          "Капитализируются только если увеличивают выгоды",
          "Учитываются как доход",
          "Всегда списываются",
          "Всегда капитализируются"
        ],
        "correct": 0
      },
      {
        "question": "Что происходит при выбытии НМА?",
        "answers": [
          "Прекращается признание, разница — прибыль/убыток",
          "Списывается только амортизация",
          "Всегда возникает убыток",
          "Учитывается как прочий доход"
        ],
        "correct": 0
      },
      {
        "question": "Как учитывается программное обеспечение?",
        "answers": [
          "Всегда как материальный актив",
          "Всегда как ОС",
          "Не признаётся активом",
          "Как НМА, если оно не является частью оборудования"
        ],
        "correct": 3
      },
      {
        "question": "Как признаются лицензии?",
        "answers": [
          "Как НМА при наличии контроля и выгоды",
          "Как ОС",
          "Как обязательства",
          "Всегда как расходы"
        ],
        "correct": 0
      },
      {
        "question": "Можно ли переоценивать НМА?",
        "answers": [
          "Да, всегда",
          "Нет, никогда",
          "Да, если существует активный рынок",
          "Только если стоимость снизилась"
        ],
        "correct": 2
      },
      {
        "question": "Что делать при увеличении стоимости НМА по модели переоценки?",
        "answers": [
          "Игнорировать",
          "Отразить в прочем совокупном доходе",
          "Отнести в расходы",
          "Отнести в прибыль"
        ],
        "correct": 1
      },
      {
        "question": "Как учитывать НМА, созданные в процессе обучения персонала?",
        "answers": [
          "Капитализировать",
          "Списывать как расходы периода",
          "Учитывать как инвестиции",
          "Относить на будущие периоды"
        ],
        "correct": 1
      },
      {
        "question": "Запасы оцениваются по:",
        "answers": [
          "Только по себестоимости",
          "Рыночной стоимости",
          "Себестоимости или чистой реализуемой стоимости, в зависимости от того, что ниже",
          "Оценке менеджмента"
        ],
        "correct": 2
      },
      {
        "question": "Какие из следующих расходов включаются в стоимость запасов?",
        "answers": [
          "Расходы на хранение готовой продукции",
          "Оба расходов",
          "Заработная плата производственного персонала",
          "Стоимость приобретения и затраты на доставку, з/п производственного персонала"
        ],
        "correct": 3
      },
      {
        "question": "Согласно требованиям IAS 2 запасы в обязательном порядке должны оцениваться по:",
        "answers": [
          "наименьшей из двух величин: себестоимости и возможной чистой стоимости реализации",
          "средней из двух величин: себестоимости и возможной чистой стоимости реализации",
          "любой из двух величин: себестоимости и возможной чистой стоимости реализации",
          "наибольшей из двух величин: себестоимости и возможной чистой стоимости реализации"
        ],
        "correct": 0
      },
      {
        "question": "Согласно требованиям IAS 2 возможная чистая стоимость реализации запасов это:",
        "answers": [
          "предполагаемая продажная цена при нормальном ходе дел, за вычетом возможных затрат на выполнение работ и возможных затрат на реализацию",
          "Нет правильного ответа",
          "предполагаемая продажная цена при нормальном ходе дел, за вычетом возможных затрат на реализацию",
          "предполагаемая продажная цена при нормальном ходе дел"
        ],
        "correct": 0
      },
      {
        "question": "При определении затрат на закупку запасов необходимо учитывать следующий алгоритм:",
        "answers": [
          "Впоследствии соответствующие суммы признаются прочими доходами; включение торговых скидок, возвратов платежей и иных аналогичных статей в себестоимость приобретаемых запасов определяется организацией самостоятельно",
          "при определении затрат на закупку они включают в себя полученные торговые скидки, а также возвраты платежей и прочие аналогичные статьи",
          "при определении затрат на закупку они не включают в себя полученные торговые скидки, а также возвраты платежей и прочие аналогичные статьи",
          "Данный пункт обязательно должен найти отражение в учетной политике. затраты на приобретение запасов включают покупную цену"
        ],
        "correct": 2
      },
      {
        "question": "Какие из следующих сведений освещены в Международном стандарте бухгалтерского учета № 1?",
        "answers": [
          "Концептуальная основа финансовой отчетности",
          "Представление финансовой отчетности",
          "Деятельность Комитета по международным бухгалтерским стандартам",
          "Первое применение международных стандартов финансовой отчетности"
        ],
        "correct": 1
      },
      {
        "question": "Какую бухгалтерскую проводку выдает организация при покупке ценных бумаг?",
        "answers": [
          "Дт Ценные бумаги Кт Расход",
          "Дт Денежные средства Кт Ценные бумаги",
          "Дт Ценные бумаги Кт Денежные средства",
          "Дт Ценные бумаги Кт Доход"
        ],
        "correct": 2
      }
    ]
  },
  {
    "id": 13,
    "title": "Блок 13",
    "questions": [
      {
        "question": "Какую бухгалтерскую проводку выдает организация при выпуске облигаций?",
        "answers": [
          "Dt Денежные средства Кт Обязательство по Облигациям",
          "Дт Денежные средства Кт Доход по облигациям",
          "Dt Обязательство по Облигациям Кт Денежные средства",
          "Дт Денежные средства Кт Расходы по облигациям"
        ],
        "correct": 0
      },
      {
        "question": "Какая двойная запись выдается при признании дохода по договору при получении аванса?",
        "answers": [
          "Д-т Выручка Д-т Обязательство по предоплате К-т Дебиторская задолженность",
          "Д-т Дебиторская задолженность К-т Обязательство по предоплате К-т Выручка",
          "Д-т Дебиторская задолженность К-т Выручка",
          "Д-т Дебиторская задолженность Д-т Обязательство по предоплате К-т Выручка"
        ],
        "correct": 3
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 680 000 тыс. сум. На отчетную дату общая сумма обязательств составила 330 000 тыс. сум., из них обязательства по налогу на доходы - 50 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 680 000 тыс. сум.;",
          "чистые активы - 330 000 тыс. сум.;",
          "чистые активы - 350 000 сумов;",
          "чистые активы - 50 000 тыс. сум.;"
        ],
        "correct": 2
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 120 000 тыс. сум. На отчетную дату общая сумма обязательств составила 85 000 тыс. сум., из них обязательства по налогу на прибыль - 35 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 35 000 000 сумов;",
          "чистые активы - 120 000 тыс. сум.;",
          "чистые активы - 65 000 тыс. сум.;",
          "чистые активы - 85 000 тыс. сум.;"
        ],
        "correct": 0
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 345 000 тыс. сум. На отчетную дату общая сумма обязательств составила 235 000 тыс. сум., из них обязательства по социальному налогу - 123 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 110 000 тысяч сумов;",
          "чистые активы - 345 000 тыс. сум.;",
          "чистые активы - 123 000 тыс. сум.;",
          "чистые активы - 235 000 тыс. сум.;"
        ],
        "correct": 0
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 710 000 тыс. сум. На отчетную дату общие обязательства составили 620 000 тыс. сум., из них обязательства по страховым выплатам - 347 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 620 000 тыс. сум.;",
          "чистые активы - 90 000 тысяч сумов;",
          "чистые активы - 710 000 тыс. сум.;",
          "чистые активы - 347 000 тыс. сум.;"
        ],
        "correct": 1
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 1 200 000 тыс. сум. Общая сумма обязательств на отчетную дату составила 900 000 тыс. сум., из них кредиторская задолженность - 50 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 900 000 тыс. сум.;",
          "чистые активы - 250 000 тыс. сум.;",
          "чистые активы - 300 000 тысяч сумов;",
          "чистые активы - 1 150 000 тыс. сум.;"
        ],
        "correct": 2
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 210 000 тыс. сум. Общая сумма обязательств на отчетную дату составила 120 000 тыс. сум., из них обязательства по налогам - 50 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 210 000 тыс. сум.;",
          "чистые активы - 160 000 тыс. сум.;",
          "чистые активы - 50 000 тыс. сум.;",
          "чистые активы - 90 000 тысяч сумов;"
        ],
        "correct": 3
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 950 000 тыс. сум. Общая сумма обязательств на отчетную дату составила 650 000 тыс. сум., из них обязательства по долгосрочным банковским кредитам - 550 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 400 000 тыс. сум.;",
          "чистые активы - 300 000 тысяч сумов;",
          "чистые активы - 100 000 тыс. сум.;",
          "чистые активы - 200 000 тыс. сум.;"
        ],
        "correct": 1
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 350 000 тыс. сум. Общая сумма обязательств на отчетную дату составила 300 000 тыс. сум., из них краткосрочные обязательства - 200 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 400 000 тыс. сум.;",
          "чистые активы - 600 000 тыс. сум.;",
          "чистые активы - 50 000 тысяч сумов;",
          "чистые активы - 150 000 тыс. сум.;"
        ],
        "correct": 2
      },
      {
        "question": "В отчете о финансовом положении организации общие активы составили 800 000 тысяч сумов. Общая сумма обязательств на отчетную дату составила 700 000 тыс. сум., из них обязательства по оплате труда - 60 000 тыс. сум. Чему будет равна сумма чистых активов этой организации?",
        "answers": [
          "чистые активы - 800 000 тыс. сум.;",
          "чистые активы - 700 000 тыс. сум.;",
          "чистые активы - 100 000 тысяч сумов;",
          "чистые активы - 40 000 тыс. сум.;"
        ],
        "correct": 2
      },
      {
        "question": "В начале 2021 года АО \"Shahar Infratuzilma Qurilish\" получило банковский кредит под 10 процентов в размере 120 000 000 сумов на строительство здания и полностью потратило его на строительство. В течение 2021 года, если строительные работы были приостановлены без причины в течение 6 месяцев, каковы будут расходы в виде процентов на прибыль или убыток в конце года (согласно требованиям МСФО 23)?",
        "answers": [
          "расходы в виде процентов - 10 000 000 сум",
          "расходы в виде процентов - 12 000 000 сум",
          "расходы в виде процентов - 120 000 000 сум",
          "расходы в виде процентов - 6 000 000 сум"
        ],
        "correct": 3
      },
      {
        "question": "В начале 2025 года АО \"Mega Inshoot Development\" получило банковский кредит под 20 процентов в размере 50 000 000 сумов на строительство здания и полностью потратило его на строительство. Если строительные работы продолжались непрерывно в течение 2025 года, какова будет себестоимость здания в конце года (согласно требованиям МСФО 23)?",
        "answers": [
          "незавершенное строительство (здание) - 50 000 000 сум",
          "незавершенное строительство (здание) - 10 000 000 сум",
          "незавершенное строительство (здание) - 55 000 000 сум",
          "незавершенное строительство (здание) - 60 000 000 сум"
        ],
        "correct": 3
      },
      {
        "question": "В начале 2025 года АО \"Олтин Гишт Курилиш\" получило 15-процентный банковский кредит в размере 200 000 000 сумов на строительство здания и полностью потратило его на строительство. Если в течение 2025 года строительные работы были приостановлены без причины в течение 6 месяцев, какова будет себестоимость здания в конце года (согласно требованиям МСФО 23)?",
        "answers": [
          "незавершенное строительство (здание) - 200 000 000 сум",
          "незавершенное строительство (здание) - 215 000 000 сум",
          "незавершенное строительство (здание) - 230 000 000 сум",
          "незавершенное строительство (здание) - 30 000 000 сум"
        ],
        "correct": 1
      },
      {
        "question": "АО \"Замонавий Уй-Жой Курилиш\" в начале 2025 года получило банковский кредит в размере 700 000 000 сумов под 10%. Какая часть расходов по займам будет капитализирована, если строительные работы продолжались непрерывно в течение 2025 года (согласно требованиям МСФО 23)?",
        "answers": [
          "не капитализируемый",
          "сумма капитализации - 700 000 000 сум.",
          "сумма капитализации - 7 000 000 сум.",
          "сумма капитализации - 70 000 000 сум"
        ],
        "correct": 3
      },
      {
        "question": "АО \"Шарк Иншоат Курилиш\" в начале 2026 года получило банковский кредит в размере 200 000 000 сумов под 10% годовых на строительство здания. Какая часть затрат по займам будет капитализирована, если строительные работы продолжались непрерывно в течение 2026 года (согласно требованиям МСФО 23)?",
        "answers": [
          "сумма капитализации - 20 000 000 сум",
          "сумма капитализации - 10 000 000 сум.",
          "не капитализируемый",
          "сумма капитализации - 200 000 000 сум."
        ],
        "correct": 0
      },
      {
        "question": "АО \"Тараккиёт Сервис Курилиш\" в начале 2025 года получило банковский кредит в размере 1 000 000 000 сумов под 10% годовых на строительство здания.Какая часть расходов по займам будет капитализироваться, если строительные работы продолжались непрерывно в течение года (согласно требованиям МСФО 23)?",
        "answers": [
          "сумма капитализации - 50 000 000 сум.",
          "сумма капитализации - 1 000 000 000 сум.",
          "не капитализируемый",
          "сумма капитализации - 100 000 000 сум"
        ],
        "correct": 3
      },
      {
        "question": "В начале 2024 года АО \"Миллий Курилиш Тараккиёт\" получило банковский кредит в размере 100 000 000 сумов под 20 процентов годовых на строительство здания. Какая часть расходов по займам будет капитализироваться, если строительная деятельность приостановлена в течение 6 месяцев в связи с отсутствием строительных материалов в течение 2024 года (по требованию МСФО 23)?",
        "answers": [
          "сумма капитализации - 10 000 000 сум",
          "сумма капитализации - 20 000 000 сум.",
          "сумма капитализации - 100 000 000 сум.",
          "не капитализируемый"
        ],
        "correct": 0
      },
      {
        "question": "АО \"Миллий Курилиш Тараккиёт\" в начале 2024 года получило банковский кредит в размере 100 000 000 сумов под 10% годовых на строительство здания. Какая часть расходов по займам будет капитализироваться, если строительная деятельность приостановлена в течение 6 месяцев в связи с отсутствием строительных материалов в течение 2024 года (по требованию МСФО 23)?",
        "answers": [
          "сумма капитализации - 20 000 000 сум.",
          "сумма капитализации - 100 000 000 сум.",
          "не капитализируемый",
          "сумма капитализации - 5 000 000 сум"
        ],
        "correct": 3
      },
      {
        "question": "АО \"Лойиха курилиш\" в начале 2025 года получило банковский кредит в размере 1 000 000 000 сумов под 15%. Какая часть расходов по займам будет капитализироваться, если строительная деятельность приостановлена в течение 6 месяцев из-за отсутствия строительных материалов в течение 2025 года (согласно требованиям МСФО 23)?",
        "answers": [
          "сумма капитализации - 75 000 000 сумов",
          "сумма капитализации - 200 000 000 сум.",
          "не капитализируемый",
          "сумма капитализации - 150 000 000 сум."
        ],
        "correct": 0
      },
      {
        "question": "АО \"Yangi Obod Maskan\" 1 июля 2026 года привлекло долгосрочный банковский кредит в размере 300 000 000 сумов под 20 процентов годовых на строительство здания. Какая часть затрат по займам за отчетный период 2026 года будет капитализирована, если строительные работы продолжались непрерывно в течение 2026 года (по требованию МСФО No 23)?",
        "answers": [
          "сумма капитализации расходов по займам - 300 000 000 сум.",
          "сумма капитализации расходов по займам - 30 000 000 сум.",
          "расходы по займам не капитализируются",
          "сумма капитализации расходов по займам - 60 000 000 сум."
        ],
        "correct": 1
      },
      {
        "question": "АО \" Hudud Yo‘l va Ko‘priklar \" 1 июля 2024 года для строительства здания привлекает долгосрочный банковский кредит в размере 400 000 000 сумов под 10%. Какая часть расходов по займам за отчетный период 2024 года будет капитализирована, если строительные работы продолжались непрерывно в течение 2024 года (по требованию МСФО 23)?",
        "answers": [
          "сумма капитализации расходов по займам - 40 000 000 сум.",
          "расходы по займам не капитализируются",
          "сумма капитализации расходов по займам - 20 000 000 сум.",
          "сумма капитализации расходов по займам - 400 000 000 сум."
        ],
        "correct": 2
      },
      {
        "question": "Налогооблагаемая прибыль предприятия \"Хамкор Савдо,\" определенная налоговыми органами в соответствии с установленными правилами, составила 120 000 000 сумов. Если ставка налога на прибыль составляет 20%, отразите сумму обязательства по налогу на прибыль в двойной записи.",
        "answers": [
          "Дт Обязательство по налогу на прибыль - 12 000 000 сумов; Кт Расходы по налогу на прибыль - 12 000 000 сумов;",
          "Дт Расходы по налогу на прибыль - 120 000 00 сумов; Кт Обязательство по налогу на прибыль - 120 000 00 сумов;",
          "Дт Расходы по налогу на прибыль - 24 000 000 сумов; Кт Обязательство по налогу на прибыль - 24 000 000 сумов;",
          "Дт Отложенный налог на прибыль - 1 000 000 сумов; Кт Расходы по налогу на прибыль - 1 000 000 сумов;"
        ],
        "correct": 2
      },
      {
        "question": "Налогооблагаемая прибыль предприятия \"Региональный торговый центр,\" определенная налоговыми органами в соответствии с установленными правилами, составила 300 000 000 сумов. Если ставка налога на прибыль составляет 10%, отразите сумму обязательства по налогу на прибыль в двойном записе.",
        "answers": [
          "Дт Обязательство по налогу на прибыль - 15 000 00 сумов; Кт Расходы по налогу на прибыль - 15 000 00 сумов;",
          "Дт Расходы по налогу на прибыль - 300 000 00 сумов; Кт Обязательство по налогу на прибыль - 300 000 00 сумов;",
          "Дт Отложенный налог на прибыль - 30 000 00 сумов; Кт Расходы по налогу на прибыль - 30 000 00 сумов;",
          "Дт Расходы по налогу на прибыль - 30 000 000 сумов; К-т Обязательство по налогу на прибыль - 30 000 000 сумов;"
        ],
        "correct": 3
      },
      {
        "question": "Налогооблагаемая прибыль предприятия \"Elektron Savdo,\" определенная налоговыми органами в соответствии с установленными правилами, составила 500 000 000 сумов. Если ставка налога на прибыль составляет 20%, отразите сумму обязательства по налогу на прибыль в двойном записе.",
        "answers": [
          "Дт Отложенный налог на прибыль - 100 000 00 сумов; Кт Расходы по налогу на прибыль - 100 000 00 сумов;",
          "Дт Обязательство по налогу на прибыль - 100 000 00 сумов; Кт Расходы по налогу на прибыль - 100 000 00 сумов;",
          "Дт Расходы по налогу на прибыль - 500 000 00 сумов; Кт Обязательство по налогу на прибыль - 500 000 00 сумов;",
          "Дт Расходы по налогу на прибыль - 100 000 000 сумов; Кт Обязательство по налогу на прибыль - 100 000 000 сумов;"
        ],
        "correct": 3
      }
    ]
  },
  {
    "id": 14,
    "title": "Блок 14",
    "questions": [
      {
        "question": "Налогооблагаемая прибыль предприятия \"Логистика Савдо,\" определенная налоговыми органами в соответствии с установленными правилами, составила 600 000 000 сумов. Если ставка налога на прибыль составляет 10%, отразите сумму обязательства по налогу на прибыль в двойном записе.",
        "answers": [
          "Д-т отсроченный налог на прибыль - 60 000 00 сумов; К-т Расходы по налогу на прибыль - 60 000 00 сумов;",
          "Д-т Расходы по налогу на прибыль - 60 000 000 сумов; К-т Обязательство по налогу на прибыль - 60 000 00 сумов;",
          "Д-т Расходы по налогу на прибыль - 600 000 00 сумов; К-т Обязательство по налогу на прибыль - 600 000 00 сумов;",
          "Д-т Обязательство по налогу на прибыль - 60 000 00 сумов; К-т Расходы по налогу на прибыль - 60 000 00 сумов;"
        ],
        "correct": 1
      },
      {
        "question": "Налоговая прибыль предприятия \"Comfort Savdo,\" определенная налоговыми органами в соответствии с установленными правилами, составила 900 000 000 сумов. Если ставка налога на прибыль составляет 10%, отразите сумму обязательства по налогу на прибыль в двойной записи.",
        "answers": [
          "Д-т Расходы по налогу на прибыль - 90 000 000 сумов; К-т Обязательство по налогу на прибыль - 90 000 00 сумов;",
          "Д-т отсроченный налог на прибыль - 90 000 00 сумов; К-т Расходы по налогу на прибыль - 90 000 00 сумов;",
          "Д-т Обязательство по налогу на прибыль - 90 000 00 сумов; К-т Расходы по налогу на прибыль - 90 000 00 сумов;",
          "Д-т Расходы по налогу на прибыль - 900 000 00 сумов; К-т Обязательство по налогу на прибыль - 900 000 00 сумов;"
        ],
        "correct": 0
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Национальный производственный центр\" составила 100 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, - 120 000 000 сумов. Если ставка налога на прибыль составляет 20%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 120 000 00 сум",
          "Отсроченная сумма налога - 100 000 00 сум",
          "Отсроченная сумма налога - 4 000 00 сум",
          "Отсроченная сумма налога - 20 000 00 сум"
        ],
        "correct": 2
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Инновация\" составила 160 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 170 000 000 сумов. Если ставка налога на прибыль составляет 15%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 10 000 00 сум.",
          "Отсроченная сумма налога - 160 000 00 сум.",
          "Отсроченная сумма налога - 170 000 00 сум",
          "Отсроченная сумма налога - 1 500 00 сум"
        ],
        "correct": 3
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Yangi Avlod Sanoati\" составила 235 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 230 000 000 сумов. Если ставка налога на прибыль составляет 10%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 235 000 00 сум.",
          "Отсроченная сумма налога - 500 00 сум",
          "Отсроченная сумма налога - 230 000 00 сум.",
          "Отсроченная сумма налога - 5 000 00 сум."
        ],
        "correct": 1
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Progress Line\" составила 80 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 60 000 000 сумов. Если ставка налога на прибыль составляет 10%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 2 000 00 сум",
          "Отсроченная сумма налога - 60 000 00 сум",
          "Отсроченная сумма налога - 80 000 00 сум.",
          "Отсроченная сумма налога - 20 000 00 сум"
        ],
        "correct": 0
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Navqiron Textle\" составила 650 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 680 000 000 сумов. Если ставка налога на прибыль составляет 20%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 650 000 00 сум",
          "Отсроченная сумма налога - 6 000 00 сум",
          "Отсроченная сумма налога - 30 000 00 сум.",
          "Отсроченная сумма налога - 680 000 00 сум."
        ],
        "correct": 1
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Темир йул метан\" составила 880 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 780 000 000 сумов. Если ставка налога на прибыль составляет 10%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 880 000 00 сум.",
          "Отсроченная сумма налога - 10 000 00 сум",
          "Отсроченная сумма налога - 100 000 00 сум",
          "Отсроченная сумма налога - 780 000 00 сум."
        ],
        "correct": 1
      },
      {
        "question": "Бухгалтерская прибыль ООО \"Smart Home\" составила 770 000 000 сумов, а налогооблагаемая прибыль, определенная налоговыми органами в соответствии с установленными правилами, составила 680 000 000 сумов. Если ставка налога на прибыль составляет 10%, какова будет отсроченная сумма налога?",
        "answers": [
          "Отсроченная сумма налога - 680 000 00 сум.",
          "Отсроченная сумма налога - 770 000 00 сум.",
          "Отсроченная сумма налога - 90 000 00 сум",
          "Отсроченная сумма налога - 9 000 00 сум"
        ],
        "correct": 3
      },
      {
        "question": "Валовая прибыль АО \"Аср Инфратузилма\" за отчетный период составила 300 000 000 сумов, чистая прибыль - 250 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000 штук, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "Базовый показатель прибыли на одну акцию - 250 сумов;",
          "базовый показатель прибыли на одну акцию - 300 сумов;",
          "базовый показатель прибыли на одну акцию - 3000 сумов;",
          "базовый показатель прибыли на одну акцию - 2500 сумов;"
        ],
        "correct": 0
      },
      {
        "question": "Валовая прибыль АО \"Zafar Inshoat Loyihalari\" за отчетный период составила 380 000 000 сумов, операционная прибыль - 260 000 000 сумов, чистая прибыль - 150 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "Базовый показатель прибыли на одну акцию - 150 сумов;",
          "базовый показатель прибыли на одну акцию - 1000 сумов;",
          "базовый показатель прибыли на одну акцию - 380 сумов;",
          "базовый показатель прибыли на одну акцию - 260 сумов;"
        ],
        "correct": 0
      },
      {
        "question": "Валовая прибыль АО \"Ziyo Maskan\" за отчетный период составила 700 000 000 сумов, операционная прибыль - 600 000 000 сумов, чистая прибыль - 350 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "Базовый показатель прибыли на одну акцию - 350 сумов;",
          "базовый показатель прибыли на одну акцию - 600 сумов;",
          "базовый показатель прибыли на одну акцию - 7000 сумов;",
          "базовый показатель прибыли на одну акцию - 700 сумов;"
        ],
        "correct": 0
      },
      {
        "question": "Валовая прибыль АО \"Yangi Bozor\" за отчетный период составила 400 000 000 сумов, операционная прибыль - 360 000 000 сумов, чистая прибыль - 280 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "базовый показатель прибыли на одну акцию - 400 сумов;",
          "базовый показатель прибыли на одну акцию - 360 сумов;",
          "базовый показатель прибыли на одну акцию - 100 сумов;",
          "Базовый показатель прибыли на одну акцию - 280 сумов;"
        ],
        "correct": 3
      },
      {
        "question": "Валовая прибыль АО \"Samarqand Darvoza\" за отчетный период составила 980 000 000 сумов, операционная прибыль - 860 000 000 сумов, чистая прибыль - 770 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "Базовый показатель прибыли на одну акцию - 770 сумов;",
          "базовый показатель прибыли на одну акцию - 780 сумов;",
          "базовый показатель прибыли на одну акцию - 980 сумов;",
          "базовый показатель прибыли на одну акцию - 680 сумов;"
        ],
        "correct": 0
      },
      {
        "question": "Валовая прибыль АО \"Bahor ichimliklari\" за отчетный период составила 320 000 000 сумов, чистая прибыль - 280 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "базовый показатель прибыли на одну акцию - 320 сумов;",
          "базовый показатель прибыли на одну акцию - 3800 сумов;",
          "Базовый показатель прибыли на одну акцию - 280 сумов;",
          "базовый показатель прибыли на одну акцию - 2800 сумов;"
        ],
        "correct": 2
      },
      {
        "question": "Валовая прибыль АО \"Yulduz Auto\" за отчетный период составила 1 200 000 000 сумов, чистая прибыль - 1 100 000 000 сумов. Если количество обыкновенных акций за отчетный период составило 1 000 000, определите базовый показатель прибыли на одну акцию.",
        "answers": [
          "базовый показатель прибыли на одну акцию - 1200 сумов;",
          "базовый показатель прибыли на одну акцию - 1500 сумов;",
          "Базовый показатель прибыли на одну акцию - 1 100 сумов;",
          "базовый показатель прибыли на одну акцию - 2000 сумов;"
        ],
        "correct": 2
      },
      {
        "question": "АО \"Камыш\" приобрело ООО \"Nonmahsulotlari\" за 550 000 сумов, чистые активы которого на начало отчетного периода составляли 500 000 сумов. Какая двойная запись должна быть сделана на дату покупки?",
        "answers": [
          "Дт Гудвилл - 50 000 тыс. сум.; Дт Актив - 500 000 тыс. сум; Кт Денежный средства - 550 000 тыс. сум.;",
          "Дт Инвестиции - 550 000 тыс. сум; Кт Денежный средства - 550 000 тыс. сум.;",
          "Дт Инвестиции - 500 000 тыс. сумов; Кт Денежный средства - 500 000 тыс. сум.;",
          "Дт Гудвилл - 50 000 тыс. сум.; Кт Денежный средства - 50 000 тыс. сум.;"
        ],
        "correct": 1
      },
      {
        "question": "АО \"Zamon Qurilish\" приобрело ООО \"Temir Beton\" за 220 000 000 сумов, чистые активы которого на начало отчетного периода составляли 180 000 000 сумов. Какая двойная запись должна быть сделана на дату покупки?",
        "answers": [
          "Дт Инвестиции - 180 000 тыс. сумов; Кт Денежный средства - 50 000 тыс. сум.;",
          "Дт Гудвилл - 40 000 тыс. сум.; Кт Денежный средства - 50 000 тыс. сум.;",
          "Дт Инвестиции - 220 000 тыс. сум; Кт Денежный средства - 50 000 тыс. сум.;",
          "Дт Гудвилл - 40 000 тыс. сум.; Дт Актив - 180 000 тыс. сум; Кт Денежный средства - 50 000 тыс. сум.;"
        ],
        "correct": 2
      },
      {
        "question": "На начало отчетного периода АО \"Нефть Газ Ойл\" приобрело ООО \"Петрол Ойл\" с чистыми активами в размере 320 000 тыс. сум. за 400 000 тыс. сум. Какая двойная запись должна быть сделана на дату покупки?",
        "answers": [
          "Дт Гудвилл - 80 000 тыс. сум.; Дт Актив - 320 000 тыс. сум; Кт Денежные средства - 400 000 тыс. сум.;",
          "Дт Инвестиции - 400 000 тыс. сум; Кт Денежные средства - 400 000 тыс. сум.;",
          "Дт Гудвилл - 80 000 тыс. сум.; Кт Денежные средства - 80 000 тыс. сум.;",
          "Дт Инвестиции - 320 000 тыс. сумов; Кт Денежные средства - 320 000 тыс. сум.;"
        ],
        "correct": 1
      },
      {
        "question": "АО \"Уйжой курилиш\" приобрело ООО \"Zamon Dizayn\" за 90 000 000 сумов, чистые активы которого на начало отчетного периода составляли 60 000 000 сумов. Какая двойная запись должна быть сделана на дату покупки?",
        "answers": [
          "Дт Гудвилл - 30 000 тыс. сум.; Дт Актив - 60 000 тыс. сум; Кт Денежные средства - 90 000 тыс. сум.;",
          "Дт Гудвилл - 30 000 тыс. сум.; Кт Денежные средства - 30 000 тыс. сум.;",
          "Дт Инвестиции - 60 000 тыс. сумов; Кт Денежные средства - 60 000 тыс. сум.;",
          "Дт Инвестиции - 90 000 тыс. сум; Кт Денежные средства - 90 000 тыс. сум.;"
        ],
        "correct": 3
      },
      {
        "question": "На начало отчетного периода АО \"Замон\" приобрело ООО \"Келажак\" с чистыми активами в размере 90 000 000 сумов за 200 000 000 сумов. Какая двойная запись должна быть сделана на дату покупки?",
        "answers": [
          "Дт Гудвилл - 110 000 тыс. сум; Кт Денежные средства - 110 000 тыс. сум.;",
          "Дт Инвестиции - 200 000 тыс. сум; Кт Денежные средства - 200 000 тыс. сум.;",
          "Дт Гудвилл - 110 000 тыс. сум; Дт Актив - 90 000 тыс. сум.; Кт Денежные средства - 200 000 тыс. сум.;",
          "Дт Инвестиции - 90 000 тыс. сумов; Кт Денежные средства - 90 000 тыс. сум.;"
        ],
        "correct": 1
      },
      {
        "question": "Чему равны чистые активы организаций?",
        "answers": [
          "Денежные средства",
          "В частный капитал",
          "На чистую прибыль",
          "В уставный капитал"
        ],
        "correct": 1
      },
      {
        "question": "Как определяются чистые активы организаций?",
        "answers": [
          "Чистый актив=Собственный капитал=Актив",
          "Чистый актив=Собственный капитал=Обязательства",
          "Чистый актив = Собственный капитал = Актив + Обязательство",
          "Чистый актив=Собственный капитал=Актив - Обязательство"
        ],
        "correct": 3
      },
      {
        "question": "Является ли \"Концептуальная основа представления финансовой отчетности\" стандартом в соответствии с требованиями МСФО?",
        "answers": [
          "конечно, является",
          "Определяется в учётной политике",
          "не является стандартом",
          "Имеет приоритет над стандартом"
        ],
        "correct": 2
      },
      {
        "question": "Какая сторона учитывает амортизацию при передаче основных средств в финансовую аренду в соответствии с международными стандартами?",
        "answers": [
          "Арендатор",
          "Ни одна из сторон не считает",
          "Арендодатель и арендатор",
          "Арендодатель"
        ],
        "correct": 0
      }
    ]
  }
];

let selectedTest = null;
let currentQuestion = 0;
let score = 0;
let answered = false;

const homeScreen = document.getElementById("homeScreen");
const quizScreen = document.getElementById("quizScreen");
const resultScreen = document.getElementById("resultScreen");

const blocksEl = document.getElementById("blocks");
const questionEl = document.getElementById("question");
const answersEl = document.getElementById("answers");
const progressEl = document.getElementById("progress");
const nextBtn = document.getElementById("nextBtn");

const backBtn = document.getElementById("backBtn");
const restartBtn = document.getElementById("restartBtn");
const chooseBtn = document.getElementById("chooseBtn");

const resultTitle = document.getElementById("resultTitle");
const resultText = document.getElementById("resultText");
const resultImage = document.getElementById("resultImage");

function renderBlocks() {
  blocksEl.innerHTML = "";

  tests.forEach((test, index) => {
    const button = document.createElement("button");
    button.className = "block-btn";
    button.textContent = test.title;
    button.addEventListener("click", () => startTest(index));
    blocksEl.appendChild(button);
  });
}

function startTest(index) {
  selectedTest = tests[index];
  currentQuestion = 0;
  score = 0;

  homeScreen.classList.add("hidden");
  resultScreen.classList.add("hidden");
  quizScreen.classList.remove("hidden");

  showQuestion();
}

function showQuestion() {
  answered = false;
  nextBtn.classList.add("hidden");
  answersEl.innerHTML = "";

  const q = selectedTest.questions[currentQuestion];

  progressEl.textContent = `${selectedTest.title}: ${currentQuestion + 1} / ${selectedTest.questions.length}`;
  questionEl.textContent = q.question;

  q.answers.forEach((answer, index) => {
    const button = document.createElement("button");
    button.className = "answer-btn";
    button.textContent = answer;
    button.addEventListener("click", () => checkAnswer(index));
    answersEl.appendChild(button);
  });
}

function checkAnswer(index) {
  if (answered) return;

  answered = true;

  const q = selectedTest.questions[currentQuestion];
  const buttons = document.querySelectorAll(".answer-btn");

  buttons.forEach((button) => {
    button.disabled = true;
  });

  if (index === q.correct) {
    buttons[index].classList.add("correct");
    score++;
  } else {
    buttons[index].classList.add("wrong");
    buttons[q.correct].classList.add("correct");
  }

  nextBtn.classList.remove("hidden");
}

function showResult() {
  quizScreen.classList.add("hidden");
  resultScreen.classList.remove("hidden");

  let image = "./images/bad.jpg";
  let level = "Плохой результат";

  if (score >= 11 && score <= 20) {
    image = "./images/norm.jpg";
    level = "Нормальный результат";
  }

  if (score >= 21 && score <= 25) {
    image = "./images/good.jpg";
    level = "Хороший результат";
  }

  resultTitle.textContent = level;
  resultText.textContent = `Вы набрали ${score} из ${selectedTest.questions.length}`;
  resultImage.src = image;
}

nextBtn.addEventListener("click", () => {
  currentQuestion++;

  if (currentQuestion < selectedTest.questions.length) {
    showQuestion();
  } else {
    showResult();
  }
});

backBtn.addEventListener("click", () => {
  quizScreen.classList.add("hidden");
  homeScreen.classList.remove("hidden");
});

chooseBtn.addEventListener("click", () => {
  resultScreen.classList.add("hidden");
  homeScreen.classList.remove("hidden");
});

restartBtn.addEventListener("click", () => {
  currentQuestion = 0;
  score = 0;
  resultScreen.classList.add("hidden");
  quizScreen.classList.remove("hidden");
  showQuestion();
});

renderBlocks();
